<?php
require '_head.php';
?>

<?=sct_start('intro')?>

    <p class="lead">
        Продеск се користи за планирање и писање вијести у деску, састављање распореда програма <b>емисије</b>
        (тзв. <i>rundown</i> или сценарио), те састављање <b>дневног</b> распореда програма (ЕПГ).
        <br>
        Продеск помаже новинарима, уредницима емисија, реализаторима програма, и другим колегама, да свој
        заједнички посао &mdash; припрему тв и радио програма обаве лакше, брже и боље.
    </p>

    <p>
        Да би се могао саставити детаљан ЕПГ за сваки дан, и сценарио за сваку емисију, у Продеску се одржавају каталози
        емисија, филмова и серија, те каталози маркетинг и промо блокова.
    </p>

    <p>
        Поред тога, Продеск садржи и потпрограм за организацију и људске ресурсе, у којем су подаци о структури
        свих служби и одјељења унутар предузећа, те кориснички налози свих запослених. Захваљујући томе,
        корисничке дозволе у Продеску се углавном додјељују аутоматски, на основу радног
        мјеста.
    </p>

    <p>
        Продеск је <i>веб апликација</i>, што значи да се не инсталира на рачунару него је довољно знати
        адресу (<?=APP_DOMAIN?>) и отворити је преко интернета. Према томе, можете програм отворити
        гдје год имате интернет везу - с посла, од куће, из ресторана, итд.. Можете користити било који оперативни систем
        и било који уређај - рачунар, таблет, смартфон..
    </p>

    <div class="bs-callout bs-callout-danger">
        Ради једноставности, у Продеску се користи појам "<b>ЕПГ</b>" за дневни распоред програма (или програмску кошуљицу).
        Исто тако, користи се појам "<b>сценарио</b>" за распоред програма емисије (или кошуљицу емисије).
    </div>


<?=sct_sub()?>

    <p>ТВ или радио програм су као велика слагалица:</p>
    <p>Елементи од којих се састоји <b>дневни програм</b> су:
        емисије, филмови, серије, те маркетинг и промо блокови.</p>
    <p><b>Емисија</b> се даље дијели на елементе:
        вијести, клипови (шпице или џинглови), те маркетинг и промо блокови.</p>
    <p><b>Вијест</b> може садржавати елементе који се <b>читају</b> у студију (КАМ),
        и елементе који су <b>снимљени</b> па се пуштају из режије (СКОП, <i>package</i>).
        Рјеђе, користи се и трећа врста елемента вијести, то је укључење <b>уживо</b> (ЕКСТ).</p>
    <p>Маркетинг блок обично садржи џингл и појединачне рекламе. Слично је са промо блоковима.</p>
    <p>У Продеску се пишу вијести, састављају се маркетинг и промо блокови, онда се од тог материјала састављају
        сценарији емисија, а емисије, филмови, серије, се даље слажу у дневни програм. Сви дијелови ове програмске
        слагалице су узајамно повезани и зависни, па ако на примјер промијените текст неке вијести у Дневнику,
        и на основу тога програм израчуна да се промијенило трајање вијести, онда ће се промијенити и ажурирати трајање
        Дневника, а тиме ће се промијенити и ажурирати термини емитовања емисија које слиједе послије Дневника.
    </p>

    <a href="img/basic/puzzle.gif"><img src="img/basic/puzzle.gif" class="img-responsive img_btm_mrg"></a>

<?=sct_sub()?>

    <ul>

        <li><b>Новинари</b> – припремају вијести.</li>

        <li><b>Уредник емисије</b> – саставља сценарио за своју емисију.</li>

        <li><b>Планер програма</b> – саставља ЕПГ.</li>

        <li><b>ТВ реализатор</b> – добија на једном мјесту све податке о дневном програму, о емитовању емисија,
            филмова, маркетинг и промо блокова.
        </li>

        <li><b>Кајронист</b> – преко Продеска добија све податке за кајрон – потписи, телопи, инсертери, кролови, итд.
        </li>

        <li><b>Продуцент или планер филмског програма</b> – одржава каталог филмова и серија. Из каталога се филмови
            и серије уносе у ЕПГ.
        </li>

        <li><b>Служба за маркетинг</b> – одржава каталог маркетинг клипова, блокова, итд, за унос у распоред програма.
        </li>

        <li><b>Служба за промоцију</b> – одржава каталог промотивног материјала, клипова, итд.
        </li>

        <li><b>Лектори</b> – програм користе за лекторисање свих вијести и ЕГО налога.</li>

    </ul>

<?=sct_end()?>

<?=sct_start('login')?>

    <div class="well summary">
        <ul>
            <li>Програм за интернет: Google Chrome</li>
            <li>Адреса: https://<?=APP_DOMAIN?></li>
            <li>Корисничко име и лозинка су исти као за вебмаил</li>
            <li>Увијек требате радити у сопственом корисничком налогу, немојте користити туђи</li>
        </ul>
    </div>

<?=sct_sub()?>


    <h4>1. Покрените програм за интернет (браузер).</h4>

    <p>Препоручен интернет-програм за отварање Продеска је Google Chrome.<br>
        Пречицу можете потражити на десктопу, сличица изгледа овако:</p>
    <img src="img/basic/chromium.gif" class="img-responsive img-rounded">

    <h4>2. Укуцајте адресу <b><?=APP_DOMAIN?></b></h4>

    <p>Отвориће се логин страница:</p>
    <img src="img/basic/login.gif" class="img-responsive img-rounded">

    <h4>3. Унесите своје корисничко име и лозинку.</h4>

    <p>Продеск има овјеру логина интегрисану у тзв Активни Директоријум, што значи да су логин подаци заједнички са
        другим програмима у предузећу. Корисничко име и лозинка су вам исти као за вебмаил.</p>

    <p>Ако ипак не знате своје корисничко име и лозинку, назовите корисничку подршку у ИТ служби.</p>

    <div class="bs-callout bs-callout-danger">
        <h4>Напомена</h4>
        Кад хоћете да радите у Продеску, увијек се улогујте са <b>својим</b> корисничким именом и лозинком.
        Немојте користити туђи кориснички налог. Ако је на истом рачунару раније радио неко други и
        заборавио се излоговати из програма, прво га излогујте па се затим улогујте са својим подацима.
        Ово је битно јер све што радите у Продеску, аутоматски се биљежи за улогованог корисника. На
        примјер, кад се напише нова вијест, улоговани корисник се биљежи као аутор вијести.
    </div>

<?=sct_sub()?>

    <p>
        У горњем десном углу сваке странице је линк <b>ИЗЛАЗ</b>. Преко тог линка ћете изићи из програма и
        приказаће се опет ЛОГИН страница.
    </p>

<?=sct_end()?>

<?=sct_start('navbars')?>

    <div class="well summary">
        <ul>
            <li>Црна трака: секције (потпрограми)</li>
            <li>Плава трака: категорије унутар секција + контрола за бирање канала</li>
        </ul>
    </div>

    <img src="img/basic/navbars.gif" class="img-responsive img_btm_mrg">

    <p>У црној траци су <b>секције</b>, то јест потпрограми или одвојени дијелови програма. Сасвим лијево, први линк
        (Продеск) је према стартној страници.
        Одабрана секција је обиљежена свијетлијим словима и тамнијом позадином.<br>
        Сасвим десно је линк на ово упутство које читате.
    </p>

    <p>У плавој траци су <b>категорије</b> за секцију коју изаберете. На примјер ако у црној траци изаберете
        секцију ПРОГРАМ, онда се у плавој траци приказују категорије те секције – Данас, План, Филм,
        Маркетинг, итд. Изабрана категорија је обиљежена малом бијелом стрелицом испод траке.</p>

    <p>Ако се подаци на некој страници односе само на одређени канал, онда се у плавој траци, сасвим десно, приказује
        контрола за <b>бирање канала</b>.</p>

<?=sct_end()?>

<?=sct_start('list')?>

    <p class="lead">Каталог је листа података, обично у алфабетском или другом систематичном поретку.
        Подаци се могу филтрирати на разне начине, на примјер по датуму, аутору, и тсл. Да би се пронашао
        одређени предмет у каталогу, често се користи и претрага по ријечима.</p>

<?=sct_sub()?>

    <h4>1. Каталог за вијести у деску:</h4>
    <img src="img/basic/list_nwz.gif" class="img-responsive img_btm_mrg">

    <h4>2. Каталог за филмове и серије:</h4>
    <img src="img/basic/list_film.gif" class="img-responsive img_btm_mrg">

<?=sct_sub()?>

    <p>
        Тастер за додавање новог предмета у листу се обично налази сасвим десно. Овај тастер је увијек
        зелене боје и има знак <span class="glyphicon glyphicon-plus-sign"></span>.
    </p>
    <p>
        Филтери служе за то да пронађете податке одређене врсте. Можете комбиновати више филтера, на примјер
        "све вијести које је написао Марко Марковић у периоду од задњих 7 дана".
    </p>
    <p>
        Филтери су најчешће контроле у облику тзв. падајућег менија, на примјер филтери
        ФАЗА и АУТОР у каталогу вијести. Филтер може бити и у облику контроле са кваком, на
        примјер филтери АРХИВА и НЕДАВНО у каталогу филмова и серија.
    </p>

    <img src="img/basic/list_control1.gif" class="img-responsive img_btm_mrg">

    <p>
        Разни каталози имају разне филтере. Но, ПЕРИОД и ПРЕТРАГА су стандардни филтери, користе се у скоро
        сваком каталогу.
    </p>

    <p>
        У филтер ПРЕТРАГА унесите ријечи за претрагу и затим на тастатури притисните ЕНТЕР.
    </p>

    <img src="img/basic/list_period_pretraga.gif" class="img-responsive">

    <p>
        Кад притиснете на филтер ПЕРИОД, отвориће се поље са неколико најчешће потребних периода,
        а ако ипак желите да изаберете тачно почетни и крајњи датум периода онда притисните
        на ДРУГИ ПЕРИОД па ће се отворити додатно поље са два календара за почетни и крајњи датум.
    </p>


    <h4>Трака са календаром</h4>

    <p>
        Ако желите да изаберете само <b>један</b> одређени датум, то је једноставније урадити преко календара.
    </p>

    <p>
        У траци с календаром, с лијева на десно, прво је листа <b>година</b>, затим листа <b>мјесеци</b>
        (1-12) за изабрану годину, и затим листа <b>дана</b> за изабрани мјесец.
        Изабрана година и мјесец су обиљежени црним подебљаним фонтом. Аутоматски, то јест по дефолту,
        је изабрана текућа година и текући мјесец.
    </p>

    <img src="img/basic/list_calendar.gif" class="img-responsive img_btm_mrg">

    <p>
        На примјер, рецимо да је данас <b>10</b>. март 2016, а хоћемо вијести за <b>5</b>. март 2016:
        година (2016) и мјесец (3) су већ изабрани, према томе довољно је само
        у листи дана притиснути <b>5</b> &ndash; и приказаће се вијести за тај дан.
    </p>

    <p>
        Но, ако хоћемо вијести за неки ранији мјесец, нпр за 5. децембар 2015, онда треба прво изабрати годину 2015,
        затим мјесец 12, и затим дан 5.
    </p>


<?=sct_sub()?>

    <p>
        Од тога које филтере укључите, зависи који подаци ће бити у листи резултата. Ако не изаберете ниједан филтер
        онда ће бити приказани <b>сви</b> подаци из каталога.
    </p>

    <p>
        У примјеру на слици је каталог вијести са укљученим филтером ПРЕТРАГА.
        У филтеру за претрагу унесена је само једна ријеч: "Закон"..
    </p>

    <img src="img/basic/list_results1.gif" class="img-responsive img_btm_mrg">

    <p>
        Изнад самих резултата приказује се свијетло-плава трака у којој пише који филтери су укључени.
        На десном крају траке је тастер да искључите све филтере.
        (Напомена: Филтере можете <b>појединачно</b> искључивати у траци са филтерима/контролама.)
    </p>

    <h4>Сортирање</h4>

    <p>
        Табела са резултатима је обично сортирана по колони ID. Ако желите то промијенити, притисните на назив колоне
        по којој желите сортирати табелу.
    </p>
    <p>
        Колона по којој се сортира обиљежена је знаком
        <span class="glyphicon glyphicon-arrow-down" style="opacity:0.3"></span> или
        <span class="glyphicon glyphicon-arrow-up" style="opacity:0.3"></span>
        поред назива колоне, зависно од смјера сортирања.
        Да промијените смјер, притисните још једном на исти назив колоне.
    </p>

<?=sct_end()?>

<?=sct_start('buttons')?>

    <p>Тастери за додавање <b>нових</b> елемената су зелене боје и садрже знак <span class="glyphicon glyphicon-plus-sign"></span> :</p>
    <img src="img/basic/btnz_new.gif" class="img-responsive img_btm_mrg">

    <p>Тастери за <b>измјене</b> садрже знак <span class="glyphicon glyphicon-cog"></span> :</p>
    <img src="img/basic/btnz_mdf.gif" class="img-responsive img_btm_mrg">

    <p>Тастери за <b>импорт</b> података, обиљежени су знаком:
        <span class="glyphicon glyphicon-import"></span></p>

    <p>Тастери за <b>помоћ</b> отварају одговарајући оквир са упутствима, обиљежени су знаком:
        <span class="glyphicon glyphicon-question-sign"></span></p>

    <p>Знак за <b>дефолт</b> опцију је:
        <span class="glyphicon glyphicon-thumbs-up"></span></p>

<?=sct_end()?>



<?=sct_start('printing')?>

    <p>
        Када желите одштампати ЕПГ или сценарио, или вијест, просто користите опцију за штампање која је
        у програму за интернет, то јест у браузеру (обично је довољно да притиснете <b>CTRL+P</b>).
        Правила за форматирање штампане верзије су већ уграђена у ове странице.
    </p>
    <p>
        При том, што се тиче страница за дневни распоред програма (ЕПГ) и за распоред програма емисије (сценарио),
        штампање је сређено за све врсте приказа &ndash; Листа, Стабло, Скрипт, Веб, Промптер.
    </p>

    <p>
        На слици је штампана верзија сценарија, у обичном приказу &ndash; ЛИСТА.
    </p>
    <img src="img/basic/print_scnr.gif" class="img-responsive img_btm_mrg">

    <div class="bs-callout bs-callout-info">
        <h4>Промптер</h4>
        Ако желите штампану верзију сценарија са отвореним вијестима, и то само елементе који се шаљу на ПРОМПТЕР,
        то јест који се читају, штампајте сценарио у <a href="scnr.php#sct_views_4">приказу ПРОМПТЕР</a>.
    </div>

<?=sct_end()?>







<?php
require '_foot.php';