<?php
require '_head.php';
?>



<?=sct_start('intro')?>

    <p class="lead">
        У Продеску свака вијест се повезује у одређени сценарио емисије, гдје ће бити емитована.
        Вијест је подијељена на елементе, па се захваљујући томе може израчунавати трајање вијести.
        А кад добијемо трајање свих вијести онда можемо израчунати и трајање читаве емисије.
    </p>
    <p>
        Већ у фази планирања, уредник може у сценарио емисије додати <b>задатак</b> за вијест,
        и у задатку навести планирано трајање вијести и одредити новинаре који требају припремити вијест.
        Кад на основу тог задатка новинар направи и саму вијест, у сценарију емисије она аутоматски
        замјењује задатак.
    </p>
    <p>
        <b>ЕГО</b> налози се могу асоцирати/повезати уз одређени елемент вијести (најчешће уз СКОП), али такође
        могу се повезати и уз вијест (нпр име и емаил аутора). Ријеђе, ЕГО налози се повезују уз сценарио емисије
        (нпр одјавна шпица), или уз ЕПГ (нпр кролови).
    </p>
    <p>
        Листа <b>Мој деск</b> помаже праћење одређених вијести или задатака.
        Корисник може сам било коју вијест, задатак или сценарио обиљежити за праћење.
        Осим тога, <i>аутоматско</i> праћење је укључено за вијести које је сам написао.
        За уредника, аутоматски се прате све вијести у сценарију гдје је он наведен као уредник.
        За новинара, аутоматски се прате сви задаци који су му додијељени.
    </p>
    <p>
        На страници за <b>Поставке</b> <span class="glyphicon glyphicon-wrench"></span>,
        сваки корисник може снимити своју брзину читања,
        подесити које вијести ће му долазити у листу <i>Мој деск</i>, и друго.
    </p>
    <p>
        Кад се вијест избрише из каталога, она прво иде у <b>Корпу</b>
        <span class="glyphicon glyphicon-trash"></span>, одакле се послије
        може вратити назад ако затреба, или потпуно избрисати.
    </p>

<?=sct_end()?>

<?=sct_start('story')?>

    <p class="lead">
        Основне разлике у односу на претходну верзију Продеска:<br>
        - вијест је подијељена на елементе<br>
        - свака вијест се повезује у одговарајући сценарио емисије
    </p>
    <p>

<?=sct_sub()?>

    <p>
        Вијест је раздвојена на елементе да би се могло израчунавати <i>трајање</i> вијести.
    </p>
    <p>
        У суштини, свака вијест може да се растави на дијелове који се <b>читају</b>
        и дијелове који су <b>снимљени</b>.<br>
        Ријеђе има још и трећа врста елемента, то је укључење <b>уживо</b>.
    </p>
    <div class="bs-callout bs-callout-primary">
        <p>
            КАМ је ознака за дијелове који се читају у студију, то јест који се емитују са <b>камере</b>.<br>
            СКОП је ознака за дијелове који су снимљени, дакле емитују се са <b>скопа</b>.<br>
            ЕКСТ је ознака за укључење уживо, то јест за емитовање <b>екстерног</b> сигнала.
        </p>
    </div>

<?=sct_sub()?>

    <p>
        Кад се пише нова вијест, прво ће се отворити страница за <b>НАСЛОВ вијести</b>,
        а затим страница за <b>САДРЖАЈ вијести</b>, гдје уносите текст вијести и друго.<br>
        (Исто тако, послије, кад будете хтјели да измјените одређену вијест, опет се наслов и садржај мијењају
        на одвојеним страницама.)
    </p>

    <h4>Наслов/опис вијести</h4>

    <img src="img/desk/nwz_mdf_dsc.gif" class="img-responsive img_btm_mrg">

    <p>
        Обавезно је унијети <b>наслов</b>, а од осталог можете по сопственом избору прескочити све што вам не треба.
    </p>
    <p>
        Планирано трајање није обавезно унијети. Оно служи за то да се у сценарију емисије може отприлике
        рачунати трајање емисије прије него што су вијести завршене, то јест прије него што буде познато реално трајање
        вијести. Кад вијест постане завршена и добије реално трајање, онда се планирано трајање занемарује.
    </p>
    <p>
        Испод, у блоку ЕКИПА може се навести ко је припремао вијест (новинар, сниматељ, монтажер).
    </p>

    <h4>Садржај вијести</h4>

    <img src="img/desk/nwz_mdf_content.gif" class="img-responsive img_btm_mrg">

    <p>
        Кад се додаје нова вијест, по дефолту су на страницу додати само по један елемент
        типа <i>читање</i> (КАМ) и <i>снимак</i> (СКОП).
        Но, у примјеру на слици додат је још и један елемент типа <i>уживо</i> (ЕКСТ),
        да бисмо приказали све три врсте елемената.
    </p>
    <p>
        Можете додавати колико год елемената желите, које год врсте желите.
        На дну странице су три зелена тастера за додавање нових елемената,
        по један за сваку врсту - читање (КАМ), снимак (СКОП), уживо (ЕКСТ).
    </p>
    <p>
        Ако желите избрисати одређени елемент, притисните знак <i>минус</i> у његовом горњем десном углу.
    </p>
    <p>
        Елементе можете премјештати (<i>drag&drop</i>) горе-доле.
        Ухватите за редни број или за наслов елемента и повуците.
    </p>

    <p><b>Текст</b></p>

    <p>
        За све елементе, лијево имате велико поље за <b>текст</b>.
        За елементе типа <i>читање</i> (КАМ), јасно да ту треба унијети текст који ће водитељ прочитати.
        За елементе типа <i>снимак</i> (СКОП) и <i>уживо</i> (ЕКСТ), не морате ништа унијети.
        Наравно, можете, <i>ако желите</i>, нпр уносити текст снимка, и тсл.
        (нпр, за елемент уживо, питања репортеру или госту)<br>
        Но, пазите: посљедњих неколико ријечи или посљедња линија текста из овог поља преноси се
        у листу коју прати реализатор да би знао <b>посљедње ријечи</b> снимка.
        Према томе, за елементе типа <i>снимак</i> (СКОП), ако ништа друго не уносите, упишите барем посљедње ријечи снимка.
        А ако уносите нешто друго (нпр текст снимка и тсл), онда на крају одвојите пар редова
        и упишите посљедње ријечи снимка.
    </p>

    <p><b>Водитељ</b></p>
    <p>
        За елементе типа <i>читање</i> (КАМ), десно можете изабрати који <i>по реду</i> водитељ треба читати тај елемент.
        На примјер, ако је предвиђено да у студију буду два водитеља, онда обично један водитељ прочита дио текста,
        па затим други прочита остатак.<br>
        У емисији гдје је само један водитељ, ова опција очигледно нема примјену.<br>
        Осим тога, ову опцију уредник може мијењати директно из приказа СКРИПТ за читав сценарио емисије, за све вијести.
    </p>

    <p><b>Како се рачуна трајање вијести</b></p>

    <p>
        Управо зато да би се могло израчунавати *трајање* вијести, вијест је раздвојена на елементе:
    <p>
        За елементе типа <i>читање</i> (КАМ), трајање се рачуна на основу дужине текста - како се мијења текст,
        мијења се и трајање.
    </p>

    <p>
        За елементе типа <i>снимак</i> (СКОП), трајање је познато након монтирања, па се онда уноси у Продеск ручно,
        али обично ће то урадити колеге у монтажи или режији, директно из приказа СКОП за читав сценарио емисије.
    </p>
    <p>
        За елементе типа <i>уживо</i> (ЕКСТ), знамо једино колико <i>планирамо</i> да ће трајати,
        и то планирано трајање уносимо ручно.
    </p>

    <p><b>Снимање података</b></p>

    <p>
        На дну странице умјесто једног тастера за снимање измјена (<i>submit</i>) имате два.
        Први је обични тастер, снима измјене, а други снима измјене и још подиже фазу вијести за један корак.
    </p>
    <img src="img/desk/nwz_submit.gif" class="img-responsive img_btm_mrg">

    <p>
        На примјер, кад новинар пише вијест, првим тастером (САЧУВАЈ) само снима измјене,
        а другим (САЧУВАЈ & ПОШАЉИ) снима измјене и шаље вијест уреднику.
        Дакле, други тастер је просто <i>пречица</i>, да након снимања не би морао користити контроле за
        пребацивање фазе.
    </p>

<?=sct_sub()?>

    <p>
        Кад отворите одређену вијест, можете прегледати њен садржај, мијењати фазу, избрисати вијест,
        направити копију вијести, додавати ЕГО налоге, погледати логове, итд.
    </p>

    <img src="img/desk/nwz.gif" class="img-responsive img_btm_mrg">

    <p>
        Садржај вијести је подијељен у елементе.
        Сваки елемент је обиљежен редним бројем и врстом (КАМ, СКОП, или ЕКСТ), и у горњем десном углу има
        ознаку са трајањем елемента.
    </p>
    <p>
        Изнад, десно од наслова вијести је ознака са израчунатим трајањем читаве вијести.
        Ако је у опис вијести било унесено <i>планирано</i> трајање, онда је поред <i>израчунатог</i> трајања
        наведено и планирано (ситнијим словима, црном бојом).
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Формула</h4>
        За елементе типа <b>читање</b> (КАМ), ако задржите курсор на ознаци са трајањем, приказаће се мали оквир
        то јест <i>tooltip</i> са формулом то јест подацима како је то трајање израчунато.
        <img src="img/desk/svt_formula.gif" class="img-responsive">

        Са <i>s</i> је означен број карактера, а са <i>v</i> је означена брзина читања.
        Трајање се рачуна по формули <i>s/v</i>.
    </div>

    <h4>Трака са фазама и контролама</h4>

    <p>
        Изнад траке са насловом вијести је трака са фазама и контролама.
    </p>

    <img src="img/desk/nwz_ctrlbar.gif" class="img-responsive img_btm_mrg">

    <p><b>Фазе</b></p>

    <p>
        Лијево је група контрола за пребацивање фазе. Од фазе зависе корисничке дозволе &ndash;
        ко ће моћи да мијења вијест.
    </p>
    <p>
        Фазе су редом: АУТОР, УРЕДНИК, ЛЕКТОР, и ГОТОВО.<br>
    </p>
    <p>
        Док је вијест у фази АУТОР, сматра се да још није написана до краја.
        Кад аутор вијести заврши посао, требао би вијест пребацити у фазу за уредника.
        Уредник другачије не може знати да је аутор завршио вијест.
    </p>
    <p>
        Уредник може пребацити вијест у било коју фазу, не мора ићи редом. Значи, може је вратити назад аутору,
        или послати лектору, или означити да је готова.
    </p>
    <p>
        Кад вијест дође у фазу ГОТОВО, онда ако је имала постављено <i>планирано</i> трајање, оно се више не узима у обзир.
        Пошто је вијест готова, исправним се сада сматра трајање које је <i>израчунато</i> Продеском.
    </p>

    <p><b>Контроле</b></p>

    <p>
        У реду десно, прво иде контрола за отварање и затварање свих ЕГО блокова на страници (по дефолту су сви затворени).
    </p>
    <p>
        Затим иду тастери за мијењање <b>наслова</b> и <b>садржаја</b> вијести,
        па тастер за прављење <b>копије</b> вијести (кад желимо исту вијест додати у сценарио друге емисије),
        и на крају тастер за <b>брисање</b> вијести.<br>
        Ако избришете вијест, она прво иде у корпу. Одатле је можете вратити, или потпуно избрисати.
    </p>

    <h4>Трака са навигацијом</h4>

    <p>
        Изнад траке са контролама је још и трака са навигацијом.
    </p>

    <img src="img/desk/nwz_navbar.gif" class="img-responsive img_btm_mrg">

    <p>
        Сасвим десно је прекидач за додавање вијести у листу <b>Мој деск</b>, то јест листу за праћење.
        Она по дефолту садржи све вијести које сте написали, а друге вијести можете сами додавати, ако желите.
    </p>
    <p>
        Ако је вијест повезана у одређени сценарио, онда се овдје приказује линк на сценарио емисије.
        Ако вијест отворите из одређеног сценарија, онда се преко овог линка можете вратити назад на сценарио.
    </p>
    <p>
        До њега се приказује линк на задатак, ако је вијест повезана са неким задатком.
    </p>



    <h4>ЕГО</h4>

    <p>
        ЕГО налози могу да се повезују уз вијест, а и директно уз одређени елемент у вијести (типично уз снимак, то јест СКОП).
    </p>
    <p>
        На дну сваког елемента су ЕГО контроле за тај елемент, а испод свих елемената је још један одвојен
        ЕГО блок — за ЕГО налоге који су повезани уз вијест, а не уз одређени елемент вијести.
    </p>

    <img src="img/desk/nwz_egobar.gif" class="img-responsive img_btm_mrg">

    <p>
        Гдје год да повежете ЕГО налог, уз вијест или уз одређени елемент у вијести, кајронист ће
        видјети и једно и друго, па у том смислу нема разлике.
        Но, понекад је згодно да се ЕГО налози могу раздвојити по елементима, ради јасноће
        (на примјер, ако вијест садржи више од једног елемента типа <i>снимак</i> (СКОП) или <i>уживо</i> (ЕКСТ)).
        Исправно је да се ЕГО налог повеже уз елемент на који се односи, а уз вијест да се повезује само ЕГО налог који
        се односи на вијест, нпр подаци о аутору и сниматељу.
    </p>


    <h4>Споредни блокови</h4>

    <p>
        Испод ЕГО блока су још и блокови ЕКИПА, КОПИЈЕ (ако вијест има копије, или је сама направљена
        копирањем друге вијести, овдје се приказује стабло копија) и ЛОГОВИ.
        Ови блокови су по дефолту затворени.
    </p>


<?=sct_sub()?>

    <p>
        Вијест наравно нема сврху ако се не емитује у некој емисији.
        Према томе, свака вијест се треба повезати у сценарио емисије којој припада.
    </p>
    <p>
        Састављање сценарија емисије је у надлежности уредника, то јест <i>уредник</i> одлучује које вијести
        ће повезати у сценарио емисије. Новинар не може додати вијест директно у сценарио, јер би тиме била
        остављена могућност да се грешком поремети било који сценарио емисије.
    </p>
    <p>
        Новинар може написати нову вијест из <i>каталога вијести</i> (тастер је у горњем десном углу каталога).
        Али нова вијест онда није повезана са било којим сценаријем, па уредник емисије мора <b>пронаћи</b>
        ту вијест у каталогу и додати је у сценарио емисије.
    </p>

    <div class="bs-callout bs-callout-primary">
        <p>
            Вијест <b>из каталога</b> уредник повезује са сценаријем емисије тако што у табели сценарија
            преко једног од тастера лијево, за убацивање између постојећих линија, дода нови
            елемент типа вијест, и онда ће се отворити страница на којој може у каталогу потражити и изабрати вијест.
        </p>
    </div>

    <p>
        Ако би уредник сваку вијест морао тражити по каталогу и додавати је у сценарио емисије, онда би то био
        значајан додатни терет, додатна обавеза. Да би се то поједноставило, додата је сљедећа процедура:
    </p>
    <p>
        Уредник може у сценарио додати новинару <b>задатак</b> за нову вијест.
        Задатак је просто веза са мјестом у сценарију емисије гдје нова вијест треба да се повеже.
        Новинару се додијељени задатак појављује на страници Мој деск.
    </p>
    <p>
        Мој деск је листа за праћење. Она садржи све задатке који су вам додијељени и све вијести које сте написали,
        а можете сами додавати и друге вијести, ако желите.
    </p>
    <p>
        Дакле, ту је лако пронаћи задатак, треба га отворити и из њега написати нову вијест
        (тастер је у горњем десном углу задатка).
        Нова вијест на тај начин одмах долази на предвиђено мјесто у сценарију емисије па је уредник не мора тражити
        у каталогу.
    </p>
    <p>
        Такође, ако користи ову процедуру уредник онда нема потребу стално провјеравати у каталогу да ли је
        новинар завршио вијест, јер вијест ће се сигурно појавити у сценарију чим је новинар заврши.
    </p>



    <div class="bs-callout bs-callout-primary">
        <p>
            Кад уредник жели <i>сам</i> написати нову вијест, он то може урадити директно у сценарију емисије:
            преко тастера на дну сценарија (нова вијест ће доћи на дно), или преко једног од тастера лијево,
            за убацивање између постојећих линија. Вијест је одмах повезана у сценарио.
        </p>
    </div>



<?=sct_sub()?>

    <p>
        Да бисте пронашли вијест у каталогу, обично ће вам бити довољни филтери за
        <i>аутора</i> и <i>период</i>.
    </p>
    <p>
        Филтер за <i>фазу</i> згодно је употријебити нпр кад хоћете да пронађете све вијести које су у фази ЛЕКТОР.
    </p>

    <p>
        Колона СЦЕНАРИО показује да ли је вијест повезана у неки сценарио.
        Ако јесте, онда ту пише назив емисије, и то је линк ка сценарију емисије.

        Можете користити истоимени <i>филтер</i> СЦЕНАРИО да се прикажу само вијести које су повезане у неки сценарио,
        или вијести које су <i>слободне</i>, то јест тренутно нису повезане у било који сценарио.
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Колона <i>Сценарио</i></h4>
        <p>
            Колону <i>Сценарио</i> можете, ради боље прегледности, искључити на страници за поставке.
            Онда ће се умјесто те колоне приказивати само мали линк ка сценарију
            <span class="glyphicon glyphicon-list epg"></span> , десно у колони са насловом вијести.
        </p>
    </div>

    <h4>Једна вијест &ndash; један сценарио</h4>

    <p>
        Вијест се истовремено може повезати само са једним сценаријем. Ако је потребно исту вијест повезати у
        <b>два</b> сценарија, онда можете отворити страницу вијести, па направити <b>копију</b>.
        Копија је слободна да се повеже у други сценарио.
    </p>
    <p>
        Оригинал и копија су идентичне вијести, но даље се могу одвојено мијењати и измјене се неће узајамно одразити.
    </p>
    <p>
        На страници вијести се појављује блок "Копије", да би се могло пратити гдје је све
        одређена вијест била ископирана и употребљена - пошто се иста вијест може копирати више пута,
        а такође и копија се може даље копирати, итд.
    </p>


    <img src="img/desk/stry_copies.gif" class="img-responsive img_btm_mrg">


    <p>
        Ако вијест не желите копирати него <i>премјестити</i> из једног сценарија у други,
        онда је прво откачите из првог сценарија, па ћете је моћи повезати у други сценарио.
        При том, није је довољно само искључити, него је треба избрисати и из корпе у првом сценарију.
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Импорт</h4>
        <p>
            За копирање вијести можете користити и процедуру за
            <a href="scnr.php#sct_scnr_change_2">импорт вијести из другог сценарија</a>, која ће направити
            копије вијести које изаберете у другом сценарију, па те копије повезати у овај сценарио.
        </p>
    </div>

<?=sct_end()?>























<?=sct_start('task')?>

    <p class="lead">
        Задатак је просто <b>веза</b> са мјестом у сценарију емисије гдје нова вијест треба да се повеже.
        Кад на основу задатка буде написана вијест, она га аутоматски замјењује на том мјесту у сценарију.
    </p>
    <p>
        За задатак је обавезно унијети <b>наслов</b> и одредити <b>новинара</b> који треба написати вијест.
        Наслов који поставите је уједно наслов будуће вијести.
        А новинар ће аутоматски добити тај задатак у својој листи <i>Мој деск</i>, и добиће потребне пермисије.
    </p>
    <p>
        Остале податке није обавезно унијети, можете их по сопственом избору прескочити ако вам не требају:<br>
    </p>
    <p>
        <i>Планирано трајање</i> се користи у сценарију док вијест не буде <i>готова</i>.
        Дакле, то је оријентационо трајање које служи за то да се у сценарију емисије може <b>отприлике</b> рачунати
        трајање емисије и прије него што су вијести завршене, то јест прије него што буде познато <i>реално</i>
        трајање вијести.
        Кад вијест постане завршена и добије реално трајање, онда се планирано трајање занемарује.
    <p>
        <i>Врста</i> се односи на елементе које треба имати вијест, по дефолту је КАМ+СКОП.
    </p>
    <p>
        На крају је поље за <i>опис</i>, то јест за кратко упутство у вези вијести, ако је потребно
        (премда се то обично ради усмено).
    </p>

    <img src="img/desk/task_mdf.gif" class="img-responsive img_btm_mrg">

<?=sct_sub()?>

    <p>
        Кад новинар напише вијест на основу постављеног задатка, и пребаци је у фазу УРЕДНИК,
        онда вијест аутоматски у сценарију заузима мјесто задатка.
    </p>
    <p>
        Да би на основу одређеног задатка написао вијест, новинар треба отворити тај задатак и онда
        започети нову вијест преко тастера у горњем десном углу, у траци за навигацију.
        Ово може урадити само новинар коме је задатак упућен.<br>
        Нова вијест се на овај начин повезује са тим задатаком.
        А ако је сам задатак повезан са одређеним сценаријом, онда ће и вијест бити повезана са њим (кад замијени
        задатак).
    </p>

    <img src="img/desk/task.gif" class="img-responsive img_btm_mrg">

<?=sct_sub()?>

    <p>
        Задатак на основу којег још није направљена вијест, сматра се <b>неријешеним</b>.
        У каталогу задатака постоји филтер <b>НЕРИЈЕШЕНО</b>, да се излистају само такви задаци.
    </p>
    <p>
        Задатак се у каталогу и у сценарију обиљежава слично као вијест, испред наслова има обојени
        квадрат – ознаку за фазу. Код неријешених задатака, ознака за фазу је <b>црвене</b> боје, а код ријешених,
        то јест оних за које је написана вијест, ознака се преузима од вијести.
        Нпр, ако је вијест стигла у фазу за режију, што се обиљежава зеленом бојом, онда се тако обиљежава и задатак.
    </p>
    <p>
        Додуше, у <i>сценарију</i> се може налазити само неријешен задатак или задатак у првој фази,
        то јест фази АУТОР, која се обиљежава сивом бојом.
        Јер чим вијест стигне у фазу УРЕДНИК, повезани задатак се аутоматски брише из сценарија и вијест се
        ставља на његово мјесто.
    </p>

<?=sct_end()?>













<?=sct_start('cvr')?>

    <p class="lead">
        ЕГО налог се може односити на елемент у вијести (типично снимак, то јест СКОП),
        на вијест, на сценарио емисије, или на ЕПГ.
    </p>
    <p>
        На страници вијести, на дну сваког елемента је трака за ЕГО налоге, гдје можете додати нови ЕГО налог
        уз одређени <b>елемент</b>, и прегледати ЕГО налоге који су раније додати.
    </p>

    <img src="img/desk/ego_stry_elm.gif" class="img-responsive img_btm_mrg">

    <p>
        Такође на страници вијести, испод свих елемената је још један одвојен ЕГО блок, ако желите додати
        нови ЕГО налог уз <b>вијест</b>, а не уз неки од њених елемената.
    </p>

    <p>
        А ако желите додати ЕГО налог уз одређени <b>сценарио</b> емисије (нпр, крол за одјавну шпицу),
        онда отворите тај сценарио у ЕГО приказу, и на дну је исти овакав ЕГО блок за сценарио.
    </p>
    <p>
        Гдје год да сте додали ЕГО налог, кајронист ће све налоге прегледати на једном мјесту,
        кад отвори сценарио у ЕГО приказу.
    </p>

    <br>
    <img src="img/desk/ego_list_item.gif" class="img-responsive img_btm_mrg">

    <p>
        Врсте ЕГО налога су: потпис, крол, текст блок, графика, летвице, одјавна шпица и позадина.
    </p>
    <p>
        Сваки ЕГО налог има пречицу да кајронист означи да је преузео налог (квака испред наслова).
        Зелена квака је знак да је посао већ у току или завршен, па према томе аутор не би требао
        мијењати садржај налога јер може доћи до неспоразума.
    </p>
    <p>
        Десно су пречице за мијењање и брисање налога. А сам наслов је линк ка страници тог ЕГО налога.
    </p>

<?=sct_end()?>













<?=sct_start('my_desk')?>

    <p class="lead">
        Мој деск је листа за праћење.
        Она садржи све задатке који су вам додијељени и све вијести које сте написали, а можете сами додавати и друге вијести, ако желите.
        Ова листа служи за олакшавање проналажења и праћења одређених вијести, пошто у обичном каталогу има на стотине вијести.
    </p>
    <p>
        Шта можемо означити за праћење: <b>вијест</b>, <b>задатак</b>, и <b>сценарио</b>.<br>
        Прекидач за праћење је увијек у горњем десном углу странице (у траци са навигацијом).
        На страници одређене вијести или задатка прекидач се приказује увијек, а на страници за сценарио
        прекидач се приказује једино у приказу СКРИПТ.
    </p>

    <p>
        Укључен и искључен прекидач:
        <img src="img/desk/flw_switch2.gif">
        <img src="img/desk/flw_switch1.gif">
    </p>


    <h4>Аутоматско додавање</h4>

    <p>
        Продеск аутоматски у Мој Деск додаје вијести/задатке које сте сопствено ви написали, и задатке које вам
        је уредник упутио, а такође сценарија у којима сте ви постављени као уредник.
    </p>
    <p>
        Свако од ових правила за аутоматско додавање можете искључити на страници за Поставке, ако желите.
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Уредник сценарија</h4>
        <p>
            Кад у неком сценарију будете постављени за уредника, па Продеск аутоматски укључи праћење за тај сценарио,
            онда се у Мој Деск додају све вијести и задаци који су у том сценарију.
        </p>
    </div>


    <h4>Листа</h4>

    <p>
        Листу Мој Деск можете филтрирати по врсти предмета &ndash; вијест, задатак, или емисија.
    </p>
    <p>
        Такође, можете филтрирати по периоду, као и сваку другу листу.<br>
    </p>
    <p>
        И можете филтрирати по врсти, то јест начину на који је праћење за одређени предмет било укључено:
    </p>
    <ul>
        <li>ако сте ви сами укључили праћење, онда пише <i>Пратим</i></li>
        <li>за задатке који су вам упућени, пише <i>Задато</i></li>
        <li>ако се предмет прати зато што сте му ви аутор, онда пише <i>Аутор</i></li>
        <li>ако се предмет прати зато што сте ви уредник сценарија којем припада, онда пише <i>Уредник</i></li>
    </ul>
    <p>
        У задњој десној колони је прекидач гдје можете искључити праћење за сваки од предмета у листи, ако желите.
    </p>
    <br>

    <img src="img/desk/flw_list.gif" class="img-responsive img_btm_mrg">


<?=sct_end()?>














<?=sct_start('sets')?>

    <p class="lead">
        На страници за поставке сваки корисник може снимити своју брзину читања,
        подесити које вијести ће му долазити у листу <i>Мој деск</i>, и друго.
    </p>

<?=sct_sub()?>

    <p>
        На основу брзине читања Продеск покушава израчунати трајање вијести.
        Зато би сваки водитељ требао подесити своју брзину читања, јер иначе се за вијести које он чита користи
        дефолт брзина читања, што може дати нешто мање тачан резултат.
    </p>

    <img src="img/desk/set_readspeed.gif" class="img-responsive img_btm_mrg">

    <p>
        На врху блока за брзину читања прво иде листа већ снимљених брзина (ако их има).
    </p>
    <p>
        Затим иде поље са текстом за читање. Ако желите, можете унијети неки други текст, припазите само да текст
        не буде превише кратак и да не садржи много скраћеница.
    </p>
    <p>
        На крају, испод текста су контроле &ndash; лијево је тастер којим стартујете и заустављате мјерење
        времена, а такође бришете мјерење ако желите све поновити испочетка
        (тастер мијења намјену &ndash; СТАРТ / ГОТОВО / БРИШИ),
        а десно је плави тастер (САЧУВАЈ) за снимање измјерене брзине.
        Између ова два тастера су текстуална поља за брзину и назив који ће бити снимљени.
    </p>

    <p><b>Како подесити своју брзину читања:</b></p>

    <ul>
        <li>Притисните лијеви тастер (СТАРТ), прочитајте текст, и притисните опет исти тастер<br>
            (кад га први пут притиснете, тастер СТАРТ се промијени у ГОТОВО,
            а кад га опет притиснете, промијени се у БРИШИ)</li>
        <li>Програм ће израчунати брзину читања и унијети је у поље за брзину, десно од тастера.</li>
        <li>Ако желите снимити измјерену брзину, унесите назив и притисните десни тастер (САЧУВАЈ)
        <li>А ако желите одустати, притисните лијеви тастер (БРИШИ) и вратићете се на почетно стање</li>
    </ul>

    <p>
        Кад сте снимили измјерену брзину, она се појављује у листи на врху блока.<br>
        На слици, у листи је брзина читања са називом "тв-инфо" и брзина је "17.4".
        Десно у истој линији су три контроле: да се ова брзина означи као дефолт, да се измијени назив или брзина,
        и да се избрише.
    </p>

    <p>
        Ако желите, можете снимити више брзина читања, под различитим називима. На примјер, то може бити потребно
        када исти водитељ чита вијести у тв и радио програму, пошто се у радио емисијама обично чита нешто спорије
        (отприлике 10%) у односу на тв.<br>
        У том случају, требате означити коју од ваших снимљених брзина читања желите да програм користи као дефолт.
        Просто притисните на знак <span class='glyphicon glyphicon-thumbs-up'></span> на брзини
        коју изаберете.<br>
        Ако сте снимили више брзина читања, онда ће се дакле у сваком сценарију гдје сте постављени за водитеља
        прво користити она која је дефолт, али ћете то моћи промијенити на нивоу сценарија, то јест изабрати једну
        од својих снимљених брзина читања (тако што притиснете на своје име у листи водитеља у сценарију, итд).
    </p>


<?=sct_sub()?>

    <p>
        Када отворите сценарио у приказу СКРИПТ, сви елементи које ће читати један водитељ обојени су једном бојом,
        а елементи које ће читати други водитељ обојени су другом бојом, и тако редом..
        Ово помаже да сваком водитељу буде јасније које дијелове текста он треба читати.
    </p>

    <img src="img/desk/set_colors.gif" class="img-responsive img_btm_mrg">

    <p>
        У блоку са бојама за водитеље, можете подесити која боја ће се користити за првог,
        која за другог водитеља, итд.
    </p>
    <p>
        Просто превуците квадрат са бојом (<i>drag&drop</i>) десно-лијево, да промијените редослијед.
    </p>
    <p>
        Ако сте ви један од водитеља у сценарију, онда ће ваши елементи увијек бити обиљежени <b>првом</b> бојом,
        без обзира да ли сте у сценарију постављени за првог или другог водитеља, итд.
    </p>


<?=sct_end()?>











<?=sct_start('trash')?>

    <p class="lead">
        Кад избришете неку вијест она се више не појављује у каталогу вијести, али је можете наћи у КОРПИ.
        Из корпе је можете вратити назад или сасвим избрисати.
    </p>
    <p>
        Приликом брисања, уклањају се и све референце на избрисану вијест. На примјер, ако је вијест била кориштена
        као елемент у неком сценарију, она се одатле брише.<br>
        Ако ту вијест послије <i>вратимо</i> из корпе, референце се не враћају. Значи, ако треба ту вијест вратити
        и у сценарио у којем је била прије брисања, то морате ручно урадити.
    </p>

    <img src="img/desk/trash.gif" class="img-responsive img_btm_mrg">

    <p>
        У листи Корпа заједно су вијести и задаци који су избрисани.
        За сваки предмет наведено је кад је избрисан и ко је избрисао.
        На десном крају су двије контроле, да се вијест/задатак врати назад у каталог, или да се избрише и из корпе.
    </p>

<?=sct_end()?>





<?=sct_start('prgm')?>

    <h4>Дозволе</h4>
    <p>
        На страници за одређену <i>емисију</i>, може се одредити ко треба имати програмске дозволе за сценарија те емисије.
        Дозволе омогућавају да се <b>изабере уредник</b> одређеног сценарија, и такође да се <b>мијења шаблон</b> емисије.
    </p>
    <p>
        На страници за одређену <i>редакцију</i>, такође се може одредити ко треба имати такве програмске дозволе,
        али се у том случају дозволе односе на <b>све</b> емисије у тој редакцији.
    </p>

    <h4>Поставке за емисију</h4>
    <p>
        У блоку <i>Веб-сајт</i> подешава се да ли емисију треба емитовати преко интернета (<i>Стриминг</i>),
        и још да ли треба изрезивати видео снимке те емисије и објављивати на интернету (<i>VOD</i>).
    </p>
    <p>
        У блоку <i>ЕПГ</i> подешава се да ли у ЕПГ-у треба уз ту емисију десно приказивати малу ознаку која је сигнал
        колегама у режији да емисију приликом емитовања треба <i>снимати за репризу</i>.<br>
        Осим тога, ту се такође може искључити <i>аутоматски импорт дефолт шаблона за сценарио</i>.
    </p>

    <h4>Кориштење у ЕПГ</h4>
    <p>
        На крају је још и блок у којем је статистика о кориштењу ове емисије у ЕПГ,
        то јест практично листа свих емитовања.
    </p>

<?=sct_sub()?>

    <p>
        Емисија се може ставити у *неактивно* стање.
        У том случају емисија се не приказује у листи емисија било гдје у Продеск-у, па се према томе не може
        ни додавати у ЕПГ и тсл.
        Листу неактивних емисија можете погледати ако у каталогу <i>Емисије</i> укључите филтер АРХИВА
        у траци са контролама.
    </p>
    <p>
        Кад додајете нову емисију, могло би се десити да емисија са истим називом већ постоји али је неактивна.
        То није лоше прво провјерити у листи неактивних емисија.
    </p>
    <p>
        Емисија се такође може и <b>избрисати</b>, под условом да није кориштена у ниједном ЕПГ-у.
        Но, боље је емисију ставити у неактивно стање (то јест у архиву) него избрисати.
        Треба избрисати емисију само ако је унесена грешком, или се од ње одустало прије првог емитовања.
    </p>

<?=sct_end()?>



<?php
require '_foot.php';
