<?php
require '_head.php';
?>



<?=sct_start('list')?>

    <div class="well summary">

        <ul class="lead">
            <li>Каталог филмова се користи приликом састављања дневног распореда програма (ЕПГ).</li>
            <li>Филмови су распоређени по <b>формату</b> (филм, мини-серија, серија)
                и <b>врсти</b> (играни, документарни, дјечији, остало).</li>
            <li>За сваки филм уносе се технички подаци (нпр, трајање, лиценца) и опис.</li>
            <li>Преко ЕПГ-а се прате реализована <b>емитовања</b> за сваки филм.</li>
            <li>Каталог такође садржи и податке о уговорима и филмским агенцијама.</li>
        </ul>

    </div>

    <img src="img/film/film_list.gif" class="img-responsive img_btm_mrg">

<?=sct_sub()?>

    <p>
        На врху каталога је трака са тастерима.
    </p>
    <p>
        Прва група су четири тастера за врсту каталога.
        Бирате да ли желите листу <b>предмета</b> (филмова), или листу <b>уговора</b>,
        или листу филмских <b>агенција</b> са којима се сарађује, или листу реализованих <b>емитовања</b> по датуму.
    </p>
    <p>
        Све остале групе тастера се односе само на листу предмета, то јест филмова.
        То је листа која је очигледно најбитнија.
    </p>

    <img src="img/film/film_list_btn.gif" class="img-responsive img_btm_mrg">

    <h4>Формат: филм, мини-серија, серија</h4>
    <p>
        Сљедећа група су три тастера за филтрирање филмова по формату: филм, мини-серија, серија.
    </p>
    <p>
        Ако желите приказати заједно и филмове и мини-серије и серије, притисните на тренутно селектовани
        тастер/филтер у групи, и тако ћете искључити све филтере. У том случају, у колони <i>Наслов</i>, испред
        самог наслова ће бити ситна ознака по којој ће се видјети да ли је у питању филм, мини-серија или серија.
    </p>
    <h4>Врсте: играни, документарни, дјечији, остало</h4>
    <p>
        Сљедећа група су четири тастера за филтрирање филмова по врсти: играни, документарни, дјечији, остало.
    </p>
    <p>
        Слично као са тастерима за формат, ако желите приказати заједно све врсте, притисните на тренутно селектовани
        тастер/филтер у групи, и тако ћете искључити све филтере. У том случају, у колони <i>Наслов</i>,
        испред самог наслова ће бити ситна ознака за врсту.
    </p>
    <h4>Нови филм</h4>
    <p>
        На крају, сасвим десно је тастер за додавање новог предмета. Од изабраног формата зависи да ли је то тастер
        за додавање новог филма или мини-серије или серије.
    </p>

<?=sct_sub()?>

    <img src="img/film/film_list_ctrl.gif" class="img-responsive img_btm_mrg">
    <p>
        Испод траке са тастерима је трака са филтерима/контролама:
    </p>

    <ul>
        <li><b>Уговор</b> &ndash; да филтрирате филмове по уговору под којим су заведени у каталог</li>
        <li><b>Језик</b> &ndash; у опису филма се може назначити језик, па овдје можете филтрирати филмове на
            одређеном језику</li>
        <li><b>Стање</b> &ndash; да ли је испуњен уговор филма, то јест број емитовања који је задат у уговору</li>
        <li><b>Недавно</b> &ndash; ако ставите кваку, приказаће се само филмови који су били емитовани
            (то јест кориштени у неком ЕПГ-у) у задњих 10 дана</li>
        <li><b>Архива</b> &ndash; ако ставите кваку приказаће се само филмови којима је истекла лиценца,
            иначе се (ако нема кваке) приказују само филмови којима лиценца није истекла
            или није уопште ни наведена</li>
        <li>Уобичајене контроле за <i>Период</i> и <i>Претрагу</i>. Период се односи на датум додавања у каталог.</li>
    </ul>

<?=sct_sub()?>

    <h4>ID</h4>
    <p>
        Поред обичног ID броја, у овој колони се преноси још једна информација: да ли је филм <i>испоручен</i>.
        Ако агенција још није испоручила филм (што имплицира да се филм још не може користити у програму),
        онда ID има сиву боју.
    </p>
    <h4>Наслов</h4>
    <p>
        Кад су у питању серије, уз наслов се наводи и <i>број епизода</i>.
    </p>
    <p>
        На десном крају колоне може стајати ознака за <i>језик</i>, под условом да је језик уопште
        наведен у опису филма.
    </p>
    <p>
        У случају кад је искључен филтер за формат или филтер за врсту, онда се испред наслова приказује и ситна
        ознака <i>за формат или врсту</i>.
    </p>
    <p>
        У другом реду, испод наслова, приказују се <i>жанрови</i>, ако су наведени у опису филма.
        Приказивање жанрова може се искључити на страници за поставке.
    </p>
    <p>
        Поред тога, испод наслова може стајати још и кратка <i>напомена</i>,
        која се може дефинисати на страници филма.
        На примјер, може затребати да се напомене да филм нема превода и тсл.
    </p>
    <h4>Уговор</h4>
    <p>
        Линк на страницу уговора под којим је одређени филм заведен у каталог.
        Приказивање ове колоне може се искључити на страници за поставке.
    </p>
    <h4>Трајање</h4>
    <p>
        Када су у питању обични филмови, трајање се наводи у формату <i>HMS</i>, то јест "час:минут:секунда", и
        постоје две врсте трајања: <b>приближно</b>, то јест оријентационо, које се односи на трајање филма
        са шпицама, и <b>тачно</b>, то јест реално трајање које се добије кад се филм унесе у ингест-у
        (обично се одсијече или скрати одјавна шпица), и које ће се реално користити у ЕПГ-у.<br>
        Ако је у техничке податке филма унесено ово <i>тачно</i> трајање,
        онда се у листи приказује <i>зеленом</i> бојом.
    </p>
    <p>
        Када су у питању серије, трајање је <i>описно</i>, односи се на просјечно трајање епизода,
        и служи само за оријентацију приликом планирања дневног програма.
    </p>
    <h4>Лиценца</h4>
    <p>
        Односи се на период у којем се филм у складу са уговором смије емитовати.
        Кад лиценца истекне, филм се више не приказује у листи, осим ако се укључи филтер <i>Архива</i>.
    </p>
    <h4>Емитовање</h4>
    <p>
        Обично се за филм задаје дозвољени број емитовања, у складу са уговором.
        У овој колони приказују се бројач емитовања и мини листа емитовања.
    </p>

<?=sct_end()?>




<?=sct_start('film_new')?>

    <p>
        На страници за додавање новог филма (или измјене постојећег) имате два велика блока података:
    </p>
    <p>
        Основни блок је за <i>техничке</i> податке, и требао би се потпуно попунити.
    </p>
    <p>
        Блок <b>Опис</b> можете попуњавати по вољи, ништа од података у њему није обавезно.<br>
        Зашто их онда уносимо: неки подаци се користе у каталогу, нпр језик и жанр; неки се користе у ЕПГ-у;
        остали се могу користити на веб сајту, за најаву филма и тсл.
    </p>

    <img src="img/film/film_new_basic.gif" class="img-responsive img_btm_mrg">
    <img src="img/film/film_new_dsc.gif" class="img-responsive img_btm_mrg">

    <p>
        Страница за додавање нове <b>серије</b> (или мини-серије) разликује се од странице за додавање обичног филма
        по томе што се у техничке податке уноси још и <b>број епизода</b>.<br>
        Осим тога, умјесто <i>приближног / тачног</i> трајања филма уноси се <b>просјечно</b> трајање епизода
        (служи само за оријентацију приликом планирања дневног програма).
    </p>

<?=sct_end()?>





<?=sct_start('film_dtl')?>

    <img src="img/film/film_dtl.gif" class="img-responsive img_btm_mrg">
    <p>
        Испод блока са основним подацима су још блокови:
    </p>
    <ul>
        <li><b>Емитовање</b> &ndash; листа свих емитовања тог филма, са контролама за исправљање листе,
            то јест за додавање нових линија и брисање</li>
        <li><b>Уговор</b> &ndash; кратки подаци о уговору и агенцији</li>
        <li><b>Опис</b> &ndash; описни подаци који се могу мијењати на страници за измјене,
            како је изнад објашњено</li>
        <li><b>Кориштење (ЕПГ)</b> &ndash; листа свих случајева кориштења овог филма у било којем ЕПГ-у</li>
        <li><b>Логови</b> &ndash; листа логованих акција везаних за овај филм, корисна углавном приликом
            рјешавања проблема или неспоразума</li>
    </ul>

    <h4>Серија: Епизоде</h4>

    <p>
        Страница <b>серије</b> (или мини-серије) разликује се од странице обичног филма по томе што има још и
        блок <b>Епизоде</b>.<br>
        У блоку је листа са подацима за сваку епизоду: наслов, приближно и тачно трајање.
        Податке можете ажурирати на посебној страници за измјене епизода, тастер/линк је десно изнад листе.
    </p>

<?=sct_end()?>





<?=sct_start('bcasts')?>

    <p>
        Већина филмова се купује од агенција, и у уговору се дефинише колико пута се филм смије емитовати.
        Због тога је потребно пратити реализована емитовања за сваки филм.
    </p>

<?=sct_sub()?>

    <p>
        У каталогу <b>Емитовања</b>, за сваки дан су набројани сви филмови и серије који су били емитовани по ЕПГ-у
        за тај дан. (Ако желите погледати и потпуни ЕПГ за исти тај дан, линк је у траци са насловом.)
    </p>

    <img src="img/film/film_bc.gif" class="img-responsive img_btm_mrg">

    <p>
        У првој колони су тастери за <i>овјеру</i>, то јест да се одређено емитовање <b>потврди</b> или да се
        <b>одбаци</b>. (Одбацити треба у случају кад се емитовање <i>није</i> десило, иако је било предвиђено по ЕПГ-у.)
    </p>
    <p>
        Свако емитовање се сматра <i>реализованим</i>, то јест броји се, једино након што се <i>потврди</i>.
    </p>
    <p>
        Емитовање које се <i>одбаци</i>, не узима се у обзир, то јест не броји се,
        али се приказује у листи емитовања одређеног филма, означено црвеном умјесто зеленом бојом.
    </p>
    <p>
        <i>Неовјерена</i> емитовања (то јест, која нису још ни потврђена ни одбачена, него су практично игнорисана)
        се такође не броје, и приказују се само у детаљној листи емитовања, на страници филма.
    </p>
    <p>
        На дну колоне су и тастери за овјеру <b>свих</b> линија одједном.
        Ако све јесте емитовано онако како пише у ЕПГ-у, а најчешће јесте, онда је најлакше једним потезом
        потврдити све линије.
    </p>

    <p>
        За серије (и мини-серије) овјерава се само <b>прва</b> епизода. За све остале епизоде зато се умјесто
        тастера за овјеру у првој колони приказује само ознака "&#8800;1".
    </p>

    <p>
        Овјера је такође искључена кад је филм обиљежен као <b>реприза</b>,
        пошто се у уговорима обично подразумијева да се репризно емитовање филма не броји.
    </p>

    <p>
        На слици, први филм је потврђен, па зато има зелени квадрат умјесто тастера за потврђивање.
        Други филм је одбачен, па зато има црвени квадрат. Затим слиједи серија која се игнорише јер није прва
        епизода него шеснаеста. Затим иде друга серија, и то баш прва епизода, па зато има тастере за овјеру.
        Затим још неколико серија које нису прве епизоде. На крају још једна серија код које је прва епизода.
    </p>

<?=sct_sub()?>

    <p>
        Подаци о емитовањима за одређени филм се приказују <i>на страници филма</i> &ndash; одмах испод
        блока са основним подацима о филму је блок <i>Емитовање</i>.
    </p>
    <p>
        Поред тога, <i>у каталогу филмова</i> се у колони <i>Емитовање</i> приказују подаци о емитовањима за сваки филм.
        Додуше, умјесто детаљне листе емитовања, пошто нема простора, приказује се скраћена то јест мини-листа.
    </p>

    <h4>Бројач емитовања</h4>
    <img src="img/film/film_bc_countbox.gif" class="img-responsive">
    <p>
        То су три спојена квадратића са бројевима &ndash; сиви, црни и зелени.
        Сиви показује колико је <b>реализованих</b> емитовања, црни колико емитовања је <b>дозвољено</b> уговором,
        а зелени колико емитовања је још <b>преостало</b>.
    </p>
    <p>
        Ако дозвољени број емитовања није постављен (на примјер, за филмове сопствене продукције нема ограничења
        у вези емитовања), онда се приказује звјездица.
    </p>

    <h4>Мини-листа емитовања</h4>
    <img src="img/film/film_bc_list_mini.gif" class="img-responsive">
    <p>
        Приказује се у каталогу филмова.
        Набројана су сва <i>овјерена</i> емитовања, пошто је приликом бирања филма за
        ЕПГ битно знати не само колико емитовања је раније реализовано, него и колико времена је прошло
        између претходних емитовања.
    </p>
    <p>
        Не даје пуни термин емитовања, него само годину и мјесец.
        Тамнији квадратић је за годину, а свијетлији за мјесец.
    </p>
    <p>
        Ако у архиви још увијек постоји ЕПГ који садржи одређено емитовање филма, онда ће у квадратићу бити линк ка
        каталогу емитовања за тај ЕПГ.
        (На слици, посљедњи квадрат, "15 09" има такав линк, што се види по нешто тамнијој боји текста.)
    </p>

    <h4>Пуна листа емитовања</h4>
    <p>
        Приказује се у блоку <i>Емитовање</i> на страници филма.
        Садржи све податке о емитовањима &ndash; не само она која су овјерена него и она која нису.
        Неовјерена емитовања се наводе пошто се може десити да је неко емитовање било реализовано
        али је грешком остало неовјерено, па би у том случају бројач емитовања приказивао погрешне податке,
        и зато је битно приказати таква емитовања на страници филма, да би грешку на вријеме уочили.
    </p>
    <img src="img/film/film_bc_list.gif" class="img-responsive img_btm_mrg">
    <p>
        За свако емитовање је наведен термин из ЕПГ-а, и испред термина је квадрат са ознаком:
    </p>
    <p>
        Зелени квадрат значи <b>реализовано</b> емитовање. Идеално је да сва емитовања у листи буду те врсте.<br>
    </p>
    <p>
        Црвени квадрат значи нереализовано, то јест <b>одбачено</b> емитовање &ndash;
        филм је био стављен у ЕПГ, али због неке ванредне ситуације није емитован, а ЕПГ нико није ажурирао.<br>
    </p>
    <p>
        Бијели квадрат значи <b>неовјерено</b> &ndash; емитовање нико још није овјерио,
        то јест у ЕПГ-у имамо филм али нико још није ручно потврдио да ли је тај филм заиста био емитован или није.
    </p>
    <p>
        Ако у архиви још увијек постоји ЕПГ који садржи одређено емитовање филма, онда ће датум емитовања бити
        линк ка каталогу емитовања за тај ЕПГ.
        (На слици, сва емитовања имају такав линк.)
    </p>

<?=sct_sub()?>
    <p>
        Прво пробајте емитовање исправити преко линка који је на њему, то јест преко каталога емитовања.
    </p>
    <p>
        Ако је то немогуће, нпр када треба <i>ручно</i> унијети податке за емитовања којих нема у ЕПГ-у
        (нпр зато што је ЕПГ избрисан из архиве, и тсл) онда морате користити контроле за исправљање листе.
    </p>
    <p>
        Контроле се активирају преко тастера за измјене, у доњем десном углу.<br>
        Поред сваке овјерене линије се приказује контрола за брисање,
        а на дну се приказује контрола за ручно додавање нове линије, то јест новог записа о емитовању.
    </p>
    <img src="img/film/film_bc_list2.gif" class="img-responsive img_btm_mrg">

    <p>
        На слици је блок <i>Емитовање</i> са укљученим контролама за измјене, то јест за исправљање листе.
    </p>

<?=sct_end()?>





<?=sct_start('channels')?>

    <p>
        У каталогу филмова сасвим десно у траци са навигацијом је контрола за бирање канала.
        Од тога који канал изаберете, зависи који филмови ће се приказати у каталогу.
        То јест, приказаће се само филмови код којих је тај канал назначен у блоку за техничке податке,
        што се може подешавати приликом додавања филма или касније на страници за измјене.
    </p>

<?=sct_sub()?>
    <p>
        Ако компанија емитује на више тв канала, онда Продеск прати емитовање филма на свим каналима.
    </p>

    <h4>Бројач емитовања</h4>
    <p>
        По дефолту, емитовања са свих канала се броје <b>заједно</b>, то јест претпоставља се да се уговором
        постављени максималан број емитовања односи генерално на компанију, а не на појединачне канале.
    </p>
    <p>
        У конфигурацији Продеска ова поставка се може промијенити,
        ако је потребно бројати емитовања одвојено за сваки канал.
    </p>

    <h4>Листа емитовања</h4>

    <p>
        Ако је за одређени филм назначено да се емитује на више канала, онда се у листи емитовања (на страници филма)
        наводе подаци у групама редом за све назначене канале.
    </p>
    <img src="img/film/film_bc_list_chnlz.gif" class="img-responsive img_btm_mrg">
    <p>
        У мини-листи емитовања (у каталогу филмова) по дефолту се приказују само емитовања за канал
        који је тренутно изабран у каталогу (у траци за навигацију).
    </p>
    <img src="img/film/film_bc_list_mini_chnlz_off.gif" class="img-responsive img_btm_mrg">
    <p>
        На страници са поставкама можете подесити да се и у мини-листи приказују емитовања за СВЕ канале умјесто
        само за изабрани канал.
        У том случају подаци о емитовањима се наводе у групама редом за све назначене канале,
        почевши са каналом који је тренутно изабран у каталогу.
        За све сљедеће канале приказује се на почетку ознака канала, то јест жута једнословна
        ознака (посљедње слово у називу канала), пошто нема простора за пуни назив.
        Нпр ако се канал зове "ТВ1", онда је ознака "1", или ако се канал зове "ТВ+", онда је ознака "+".
    </p>
    <img src="img/film/film_bc_list_mini_chnlz.gif" class="img-responsive img_btm_mrg">

<?=sct_end()?>





<?=sct_start('contracts')?>

    <p>
        На страници одређеног уговора је листа свих предмета, то јест филмова и серија, који су обухваћени
        тим уговором.
    </p>
    <p>
        Десно изнад листе су тастери за додавање новог филма (или серије или мини-серије) у уговор. Кад на овај
        начин додате нови филм, процедура је потпуно иста као кад га додајете из каталога филмова, осим што
        је нови филм унапријед већ повезан са уговором.
    </p>

    <img src="img/film/film_contracts.gif" class="img-responsive img_btm_mrg">

<?=sct_end()?>





<?=sct_start('agents')?>

    <p>
        На страници одређене агенције је листа свих уговора који су направљени са том агенцијом.
    </p>

<?=sct_end()?>






<?php
require '_foot.php';

