<?php
require '_head.php';
?>



<?=sct_start('intro')?>

    <p class="lead">
        Сценарио је план емитовања, до најситнијих детаља.
        Да би се могли приказати сви детаљи, има више специфичних приказа сценарија, сваки са одређеним детаљима.
    </p>

    <p>
        Основни приказ је <b>Листа</b>, то је проста листа елемената у сценарију, без детаљних података о
        одређеном елементу.
    </p>
    <p>
        Приказ <b>Стабло</b> изаберите ако желите да се сваки елемент сценарија може отворити у подтабелу
        тако да се виде и његови елементи. Овај приказ је посебно важан у режији.
    </p>
    <p>
        <b>Скрипт</b> приказ је намијењен првенствено уредницима и водитељима. Све вијести су отворене, може се прочитати
        и испратити практично читав ток емисије, од ријечи до ријечи.
        Уредник може и мијењати текст за било коју вијест, не напуштајући ову страницу.
    </p>
    <p>
        <b>ЕГО</b> приказ је прилагођен првенствено кајронисти, ту су приказани сви ЕГО налози.<br>
    </p>
    <p>
        <b>Скоп</b> приказ приказује само снимке то јест скопове из читавог сценарија, и збир њиховог укупног трајања.
    </p>
    <p>
        <b>Промптер</b> приказ се користи за пребацивање вијести у Промптер, и за штампање вијести на одвојеним листовима.
        Овај приказ користи водитељ прије одласка у студио.
    </p>
    <p>
        На крају, приказ <b><span class="glyphicon glyphicon-trash"></span> (Корпа)</b> је листа обрисаних елемената сценарија,
        дакле нешто слично као <i>Recycle Bin</i>. Кад неки елемент искључите из сценарија, не брише се одмах него
        прво долази у ову корпу, и тек ако га избришете из корпе онда се заиста брише.
    </p>

<?=sct_sub()?>

    <h4>1. Пронађите ЕПГ који садржи ту емисију.</h4>

    <p>
        ЕПГ ћете пронаћи по <b>датуму</b>.<br>
        Ако је датум <b>данас</b>, ЕПГ је наравно на страници <i>Данас</i>.<br>
        Ако је датум <b>сутра или послије</b>, ЕПГ је на страници <i>План</i>.<br>
        Ако тражите емисију која је емитована <b>претходних дана</b>, онда ЕПГ потражите под <i>Архива</i>.
    </p>

    <h4>2. Кад сте пронашли и отворили ЕПГ, лако ћете пронаћи емисију <b>по термину емитовања</b>.</h4>

    <p>Притисните назив емисије и отвориће се њен сценарио.</p>


<?=sct_end()?>

<?=sct_start('view_list')?>

    <a href="img/scnr/scnr.gif"><img src="img/scnr/scnr.gif" class="img-responsive img_btm_mrg"></a>


    <p>
        С лијева надесно, прво иду двије плаве колоне за <b>термин емитовања</b> – прва је реално вријеме
        (дневно), а друга је вријеме у односу на почетак емисије.
    </p>

    <p>
        Затим иде колона намијењена за приказивање <b>грешке</b>, то јест одступања од фиксно постављеног термина.<br>
        У емисијама <i>уживо</i> ова колона ријетко има сврху, јер се термини емитовања у нормалном раду не постављају
        фиксно него их Продеск израчунава за сваки елемент.<br>
    </p>

    <p>
        Затим иде зелена колона за <b>трајање елемента</b>.
    </p>


    <!--
    <p>
        Затим иду двије колоне везане за <b>трајање елемента</b>.
        Главна колона је <i>лијево</i>, она показује <b>важеће</b> трајање.<br>
        У колони <i>десно</i> приказује се <b>неважеће</b> трајање.
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>"Важеће" и "неважеће" трајање</h4>
        <p>
            У процесу припреме вијести, могу бити у оптицају <i>две</i> различите вриједности за трајање:
        </p>
        <p>
            Прво, док је вијест још у фази планирања, постоји план у вези тога колико би отприлике вијест требала трајати
            да би се уклопила у сценарио.
            То је, дакле, <b>планирано</b> трајање, и уредник га ако жели може унијети већ кад новинару
            поставља задатак да напише одређену вијест.
            Планирано трајање <b>није обавезно</b> унијети. Оно служи за то да се у сценарију емисије може отприлике
            рачунати трајање емисије прије него што су вијести завршене, то јест прије него што буде познато реално трајање вијести.
        </p>
        <p>
            Друго, кад новинар заврши вијест, Продеск израчунава колико ће вијест реално трајати. Ово трајање је наравно
            тачније него оно које је првобитно планирано, јер Продеск узима у обзир трајање смонтираног снимка и дужину
            текста који ће водитељ читати, итд.
        </p>
        <p>
            Зато, кад уредник означи да је вијест готова (кад је пребаци у фазу ГОТОВО), онда се планирано трајање занемарује,
            а предност добија <b>израчунато</b> (реално) трајање.
            Но, у сценарију се и даље, ради информације, приказује и једно и друго. Лијево је важеће, десно неважеће.
            При том, планирано трајање је увијек означено тамном, а израчунато трајање свијетлом зеленом бојом.
        </p>

    </div>
    -->


    <p>
        На крају иде главна колона, са <b>насловом</b> елемента. Ако је то <i>вијест</i>, онда испред наслова стоји и
        обојени квадратић &ndash; ознака за фазу у којој се вијест налази, а сасвим десно од наслова пише и име аутора вијести.
    </p>


    <h4>Подјела на сегменте</h4>

    <p>
        Сегмент је посебан елемент сценарија који служи само за организацију садржаја у цјелине, ради бољег прегледа.
        На примјер, да заокружите блок вијести из спорта, можете поставити сегмент са насловом "Спорт", који ће
        сабрати укупно трајање свих вијести у том сегменту, и израчунати термин завршетка тог сегмента.<br>
        Конкретно у овом сценарију на слици, садржај је подијељен на три сегмента: Увод, Главно и Спорт.
    </p>


    <h4>Контроле уз елементе</h4>

    <p>
        У табели садржаја, лијево поред сваке линије, то јест сваког елемента, је контрола за убацивање <b>новог</b> елемента у табелу:
        <img src="img/element_insert.gif">
    </p>

    <p>
        Десно од сваког елемента су двије контроле – за <b>искључивање</b> елемента, и за <b>подешавање</b> елемента:
        <img src="img/element_switch.gif"> <img src="img/element_modify.gif">
    </p>



<?=sct_sub()?>

    <p>
        Ако притиснете контролу то јест дугме за убацивање елемента у табелу садржаја, десно ће се отворити трака за избор елемента:
    </p>
    <img src="img/scnr/scnr_element_bar.gif" class="img-responsive img_btm_mrg">

    <p>
        Врсте елемената су:
    </p>

    <ul>
        <li>Вијест</li>
        <li>Задатак – веза са мјестом у сценарију емисије гдје нова вијест треба да се повеже.</li>
        <li>Уживо укључење</li>
        <li>Маркетинг блок</li>
        <li>Промо блок</li>
        <li>Клип – то је шпица или џингл</li>
    </ul>

    <p>
        На крају, има још и неколико помоћних елемената:
    </p>

    <ul>
        <li>Напомена – то је кратко упутство или упозорење које ће се приказати као посебна линија у сценарију</li>
        <li>Простор – може затребати кад у сценарију постоји рупа за коју тренутно није
        одлучено каквим ће се садржајем попунити</li>
        <li>Сегмент – за организацију садржаја у цјелине, на примјер подјелу вијести на рубрике</li>
    </ul>

    <p>
        Елемената има за сваку могућу ситуацију, но једноставније је него што изгледа: у редовном раду обично се користе
        само <b>вијести</b> и <b>задаци</b>. Клипови и сегменти се обично снимају у шаблоне, то јест у скелет емисије, па се сваки
        пут аутоматски додају у сценарио. Маркетинг и промо блокове додају службе које су за то задужене, и то се
        обично ради само са снимљеним емисијама или филмовима/серијама.
    </p>



<?=sct_sub()?>

    <h4>Трака са насловом</h4>

    <p>
        Изнад табеле садржаја сценарија је трака у којој су основни подаци о сценарију/емисији &ndash;
        назив емисије и тема (ако је наведена), знак за врсту емисије (уживо, снимак или реприза), а лијево су три квадрата
        за термин почетка, трајање и термин завршетка емитовања.
    </p>

    <img src="img/scnr/scnr_head.gif" class="img-responsive img_btm_mrg">

    <p>
        Квака испред наслова означава да ли је емисија спремна.
        Ако није спремна, квака је сива, ако јесте спремна, онда је зелена.
    </p>
    <p>
        Ако се емисија емитује уживо, поред наслова ће бити знак:
        <span class="glyphicon glyphicon-facetime-video" style="color:red"></span> &mdash;
        а ако је реприза, биће знак:
        <span style="color:white; background-color:black; padding:1px 3px; font-weight:bold">Р</span>
    </p>
    <p>
        У горњем углу, сасвим десно су ознаке везане за веб сајт:<br>
        <span class="glyphicon glyphicon-play-circle"></span>
        значи да ће емисија бити емитована преко интернета (<i>live streaming</i>).<br>
        <span class="glyphicon glyphicon-download"></span>
        значи да ће емисија бити снимљена и постављена на веб сајт (<i>video-on-demand</i>).
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Важеће и неважеће трајање емисије</h4>
        <p>
            Емисија <i>уживо</i> обично има два трајања. Доста раније се обично поставља <i>планирано</i> трајање
            (приликом састављања дневног распореда програма &mdash; ЕПГ-а), нпр Дневник обично по плану треба трајати око 25 минута.
            Но, кад су вијести спремне, онда Продеск може прилично
            тачно израчунати <i>реално</i> трајање, које се често разликује од планираног
            (рецимо, није испало 25:00 него 26:45 минута).<br>
            Значи, имамо два трајања &ndash; планирано и израчунато.
            Кад уредник оцијени да је емисија <i>готова</i>, нпр кад су све вијести спремне, онда треба притиснути кваку
            испред наслова да би обиљежио да је емисија спремна, и тада предност добија израчунато трајање,
            а до тога важи планирано. Онда ће се ажурирати и ЕПГ.
        </p>
        <p>
            Ако постоје два трајања (важеће и неважеће), онда се квадрат за трајање дијели на два, и важеће трајање
            се приказује у горњој а неважеће у доњој половини.
            Планирано трајање је означено тамном, а израчунато трајање свијетлом зеленом бојом.
        </p>
    </div>

    <p><b>Сатови за одбројавање</b></p>
    <p>
        Кад је емитовање емисије у току, квадрати за термине се дијеле да би у доњој половини били приказани
        сатови који одбројавају вријеме <i>од почетка</i> и вријеме <i>до завршетка</i> емисије.<br>
        То је нарочито битно реализатору, поготово сат који показује вријеме од почетка емисије,
        јер у табели садржаја има колона са терминима који се такође односе на вријеме од почетка емисије,
        па по овом сату реализатор значи може пратити да ли сценарио иде по предвиђеном распореду.

    </p>
    <p class="clearfix">
        <img src="img/scnr/scnr_head_clocks.gif" class="img-responsive" style="float:left; margin-right:7px;">
        На слици, емисија почиње у 09:00:00, а завршава у 09:11:57.<br>
        Од почетка емисије је прошло 00:03:29, а до краја је остало 00:08:28.<br>
        (слика је очигледно била снимљена у 09:03:29)</p>
    <p>На слици, важеће трајање (11:57) је <i>израчунато</i>, а неважеће (10:00) је <i>планирано</i>
        (што видимо по боји).
    </p>

    <h4>Трака са контролама</h4>

    <p>
        На врху, изнад траке са насловом, налази се трака са контролама.
        С лијева надесно, прво иде <b>сат</b>, затим група тастера за бирање <b>врсте приказа</b>,
        затим <b>филтер елемената</b>, и на крају <b>тастери за измјене</b> (измјена података о емисији, измјена садржаја, и импорт
        елемената/вијести из другог сценарија).

    </p>

    <img src="img/scnr/scnr_ctrlbar.gif" class="img-responsive img_btm_mrg">

<?=sct_end()?>

<?=sct_start('view_tree')?>

    <p>
        Приказ СТАБЛО изаберите ако желите да се сваки елемент сценарија може отворити у подтабелу
        тако да се виде и његови елементи. Овај приказ је посебно важан за рад у режији.
    </p>

    <p>
        За сваку вијест приказују се њени елементи - КАМ, СКОП..
    </p>

    <img src="img/scnr/scnr_tree.gif" class="img-responsive img_btm_mrg">

    <p>
        Плава ознака за елемент (КАМ, СКОП, ЕКСТ) је уједно прекидач за приказивање поља са текстом тог
        елемента.
    </p>

    <p>
        А у заглављу табеле, сасвим десно, су две додатне контроле/прекидача:<br>
        <span class="glyphicon glyphicon-resize-small"></span> &ndash; Прикажи/сакриј текст <b>свих</b> елемената<br>
        <span class="glyphicon glyphicon-scissors"></span> &ndash; Прикажи задње ријечи из текста<br>
    </p>

    <p>
        Реализатор поред ових има још двије контроле, помоћу којих може додавати напомене у елементима, и дефинисати
        која камера ће се користити за одређени елемент:<br>
        <span class="glyphicon glyphicon-cog"></span> &ndash; Прикажи контроле за напомене у елементима<br>
        <span class="glyphicon glyphicon-facetime-video"></span> &ndash; Прикажи контроле за дефинисање камера<br>
        На слици изнад, на примјер, у првој вијести је на тај начин дефинисана камера #2,
        и постављена напомена "Италија земљотрес" - што се односи на "покривалицу".
    </p>

    <div class="bs-callout bs-callout-primary">
        Тастер за приказ СТАБЛО истовремено служи и као прекидач за отварање/затварање свих подтабела.
        Значи, ако желите затворити подтабеле за <b>све</b> елементе, притисните опет тастер СТАБЛО.
    </div>
<?=sct_end()?>

<?=sct_start('view_script')?>

    <p>
        Овај приказ је намијењен првенствено уредницима и водитељима. Све вијести су отворене, може се прочитати
        и испратити практично читав ток емисије, од ријечи до ријечи. Уредник може и уносити брзе измјене не напуштајући
        ову страницу.
    </p>

    <img src="img/scnr/std_crewbar.gif" class="img-responsive img_btm_mrg">
    <img src="img/scnr/std_stry1.gif" class="img-responsive img_btm_mrg">
    <img src="img/scnr/std_stry2.gif" class="img-responsive img_btm_mrg">

    <p>
        На врху је сива трака са именима уредника (лијево) и водитеља (десно).<br>
        Испод иду редом вијести, са отвореним елементима типа КАМ,
        то јест отворени су само дијелови вијести које водитељ <i>чита</i>.<br>
        (На слици су двије вијести, прва је КАМ+СКОП, а друга КАМ+КАМ.)
    </p>

    <div class="bs-callout bs-callout-primary">
        Тастер за приказ СКРИПТ истовремено служи и као прекидач за отварање/затварање свих елемената вијести.
        Значи, ако желите отворити не само КАМ него и СКОП и ЕКСТ елементе, притисните опет тастер СКРИПТ.
    </div>

    <h4>Измјене вијести</h4>

    <p>
        Уредник емисије има програмске дозволе за разне измјене:
    </p>

    <p>
        <b>Текст за читање</b> је интерактиван. Кад желите промијенити одређени текст, дупло-притисните на њега
        и отвориће се поље за измјену текста.
        На слици, доњи текст је отворен за измјене, што се види по жутој позадини и активном курсору.
        Кад завршите, да бисте снимили измјене, притисните било гдје мимо текста.
        Одустати од измјена можете са тастером <i>ESCAPE</i>.
    </p>

    <p>
        <b>Знак за фазу</b> је такође интерактиван. Довољно је притиснути квадратић за фазу и подићи ћете фазу за један степен.
    </p>

    <p>
        <b>Водитеља</b> који ће читати одређени текст можете промијенити кликом на тастер лијево од текста.
    </p>

    <div class="bs-callout bs-callout-primary">
        Ако су ваше измјене промијениле трајање вијести (нпр ако сте значајно промијенили текст),
        онда када завршите све измјене, притисните <i>F5</i> ако желите
        да вам се одмах прикажу прерачунати термини, то јест да вам се страница ажурира.
    </div>

    <h4>Одређивање уредника и водитеља</h4>

    <p>
        Уреднике и водитеље одређујете на страници за измјене података о емисији,
        (линк је на врху у траци са контролама, десно).
        Важно је на самом почетку (или што раније) одредити уредника емисије
        јер од тога зависе пермисије за овјеру вијести и др.
        Такође, важно је и одредити водитеље, јер се трајање вијести рачуна на основу брзине читања
        за одређеног водитеља.
        (Док не одредите водитеља, рачуна се по <i>дефолт</i> брзини читања, која може бити нешто мање тачна.)
    </p>

    <p>
        Ако сте одредили водитеља, његово име ће се појавити у траци на врху.
        Кликните на то име да отворите оквир <b>Брзина читања</b> и погледате која брзина је подешена
        за одређеног водитеља.<br>
        (Самом водитељу се поред тренутно изабране брзине приказују и контроле за <i>бирање</i> брзине читања &ndash;
        под условом да je снимио више различитих брзина.)
    </p>


<?=sct_end()?>

<?=sct_start('view_cvr')?>

    <p>
        Овај приказ је намијењен првенствено кајронисти, ту су приказани сви ЕГО налози.
    </p>
    <p>
        ЕГО налози се обично вежу уз елемент у вијести (типично снимак, то јест СКОП), или уз вијест,
        али могу се везати и генерално уз сценарио емисије, као нпр крол за одјавну шпицу.
        Кад сценарио емисије отворите у приказу ЕГО, на врху изнад обичних налога је оквир са листом таквих налога,
        ако их има, а у траци са контролама изнад, десно је контрола за додавање новог ЕГО налога везаног уз сценарио.
    </p>

    <div class="bs-callout bs-callout-default">
        <h4>Филтер</h4>
        У траци са контролама, филтер елемената ради другачије у односу на приказ Листа или приказ Стабло:
        можете филтрирати одређену врсту ЕГО налога, на примјер само потписе или само кролове, и слично.
    </div>

    <h4>Кваке</h4>

    <p>
        Сваки ЕГО налог има пречицу да кајронист означи да је преузео налог, то је квака испред наслова.
        Зелена квака је дакле знак да је кајронист почео припремати или је већ припремио налог.
    </p>
    <p>
        Сличну контролу има и лектор. Када он означи одређени ЕГО налог, онда се додаје жута квака.
        Према томе, по боји кваке може се видјети да ли је ЕГО налог лекторисан, а затим да ли га је кајронист преузео
        и припремио.
    </p>

    <h4>Контроле за кајронисту</h4>

    <p>
        <b>Текст ЕГО налога</b> је интерактиван. Кад желите промијенити одређени текст, притисните на њега
        и отвориће се поље за измјену текста.
    </p>

    <p>
        У заглављу ЕГО налога, десно се налазе контрола за отварање странице за измјене, и контрола за брисање.
        Поред њих су и двије помоћне контроле:<br>
        <span class="glyphicon glyphicon-duplicate"></span> &ndash; Копирај текст (читав текст налога се копира у клипборд)<br>
        <span class="glyphicon glyphicon-retweet"></span> &ndash; Конверзија текста (UTF&gt;DOS) &ndash; за конверзију
        из нормалне ћирилице у ћирилицу која се користи у застарјелим програмима<br>
    </p>

    <div class="bs-callout bs-callout-primary">
        Тастер за приказ ЕГО истовремено служи и као прекидач за отварање/затварање свих ЕГО налога.
        Значи, ако желите затворити све налоге, тако да добијете преглед само по насловима, притисните опет тастер ЕГО.
    </div>

<?=sct_end()?>

<?=sct_start('view_rec')?>

    <p>
        Приказ СКОП приказује само снимке то јест скопове из читавог сценарија,
        и на дну табеле се приказује збир трајања свих снимака.
    </p>

    <img src="img/scnr/scnr_record.gif" class="img-responsive img_btm_mrg">

    <p>
        Трајање сваког снимка се може уносити на самој страници. Довољно је притиснути на трајање и текст ће се претворити
        у поље за измјене. На слици је на трећем скопу отворено поље за измјену.
    </p>

    <p>
        Трајање се уноси у формату <b>мм:сс</b>.<br>
        Ако желите, можете изоставити нуле на почетку или двотачку између минута и секунди.
        На примјер, умјесто "01:47" можете унијети "147".. умјесто "00:57" можете унијети "57", итд.
    </p>

<?=sct_end()?>

<?=sct_start('view_prompter')?>

    <p>
        Овај приказ користи водитељ прије одласка у студио &mdash; за пребацивање вијести у Промптер,
        и за штампање вијести на одвојеним листовима.
    </p>

    <p>
        Све вијести су сложене у поље за текст, у формату који одговара Промптеру. Довољно је притиснути унутар поља
        и садржај ће бити ископиран у клипборд.
    </p>

    <p>
        Када желите одштампати све вијести на посебним листовима, просто користите опцију за штампање која је
        у програму за интернет, то јест у браузеру (обично је довољно да притиснете <b>CTRL+P</b>).
    </p>

<?=sct_end()?>

<?=sct_start('view_trash')?>

    <p>
        Кад <b>искључите</b> неки елемент у табели садржаја (користећи контролу десно од линије елемента), та линија се престаје
        урачунавати али се и даље приказује у табели садржаја (прекривена је сивом бојом), и можете је поново укључити
        ако желите. На тај начин уредник може на примјер држати пар вијести у резерви, или може нпр провјерити колико би
        трајао сценарио ако искључи ову или ону вијест, и слично.
    </p>

    <p>
        Ако искључену вијест желите сасвим <b>избрисати</b> из сценарија, то можете урадити у приказу КОРПА. У корпу
        долазе све вијести које су искључене у сценарију. Кад сте сигурни да вам искључена вијест дефинитивно неће
        требати у сценарију, онда је избришите из корпе.
    </p>

    <div class="bs-callout bs-callout-default">
        <h4>Напомена</h4>
        Вијести, клипови, маркетинг и промо блокови у Продеску се налазе у одвојеним потпрограмима, и кад их додајете
        у одређени сценарио, ви их бирате из листе/каталога. Према томе, кад их бришете из одређеног сценарија, они и даље
        остају у својим каталозима, само се прекида веза са тим сценаријом. На примјер, када избришете из сценарија
        одређену вијест, ви је нисте избрисали из Продеска, она је и даље у свом каталогу и може да се употријеби нпр
        у неком другом сценарију.<br>
        Ако бисте хтјели да избришете вијест не само из одређеног сценарија него сасвим из Продеска, морали бисте
        отворити њену страницу у каталогу вијести, па је одатле избрисати.
    </div>

<?=sct_end()?>





<?=sct_start('scnr_dsc')?>

    <p>
        Подаци о емисији се обично постављају већ приликом састављања <i>дневног</i> распореда програма, то јест ЕПГ-а.
        Али, може затребати да се нешто од података касније промијени.
        Зато уредник има програмске дозволе за измјене..
    </p>
    <p>
        Како мијењати податке о емисији:
    </p>
    <p>
        У траци са контролама, сасвим десно су (плави) тастери за измјене.
        Први слијева је за измјене података о емисији.
    </p>

    <img src="img/scnr/scnr_ctrlbar.gif" class="img-responsive img_btm_mrg">

    <p>
        У првом блоку су основни подаци.
    </p>
    <p>
        <i>Фиксни термин</i> се уноси само за емисије које морају почети баш у одређеном термину, попут Дневника..
    </p>
    <p>
        <i>Планирано трајање</i> се обично уноси приликом састављања ЕПГ-а, дакле уноси га планер дневног програма.
    </p>
    <p>
        Трајање емисије је битно јер се на основу њега израчунава термин почетка <i>сљедеће</i> емисије
        у дневном распореду..<br>
        Кад уредник емисије <i>заврши</i> сценарио емисије, онда програм израчунава <i>реално</i> трајање емисије,
        које је тачније од оног које је раније било планирано, па онда планирано трајање више није потребно и занемарује се.
    </p>
    <p>
        Уредник само треба означити да је сценарио СПРЕМАН, да би програм знао да треба умјесто
        планираног трајања користити израчунато.
        Но, ради тога не мора отварати ову страницу за измјене, јер на страници сценарија
        има пречицу — то је квака испред наслова..<br>
        Дакле, кад је сценарио завршен, онда уредник треба притиснути ову кваку да би програм почео користити
        <i>израчунато</i> трајање умјесто <i>планираног</i> трајања, и тиме се ажурира читав дневни програм, то јест ЕПГ.
    </p>

    <img src="img/scnr/scnrmdf_basic.gif" class="img-responsive img_btm_mrg">

    <p>
        Испод основног блока слиједе блокови у којима се наводи ЕКИПА. Први је екипа из деска (уредници и водитељи),
        а други је екипа из режије. Овдје се дакле одређује ко су уредници и водитељи, што је веома битно.
        Ако уреднику затреба да одреди водитеље, или да промијени водитеље, то се дакле ради овдје.
    </p>
    <p>
        У свакој линији, лијево је тастер за додавање још једне линије, а десно је тастер за брисање.
    </p>

    <img src="img/scnr/scnrmdf_crew.gif" class="img-responsive img_btm_mrg">

    <p>
        Затим слиједи блок са подацима о СНИМКУ емисије. Овај блок се наравно не користи за емисије <i>уживо</i>,
        него само за <i>снимљене</i> емисије. Обично податке о снимку уноси техничар приликом процеса инџеста.
    </p>

    <p>
        На крају је блок са подешавањима везаним за веб сајт:
    </p>

    <img src="img/scnr/scnrmdf_web.gif" class="img-responsive img_btm_mrg">

<?=sct_end()?>

<?=sct_start('scnr_content')?>

    <p>
        Корисник који је у сценарију емисије одређен као уредник има програмске дозволе за измјене садржаја сценарија.
        Садржај сценарија се може мијењати на два начина:<br>
    </p>
    <ul>
        <li>
            Сваки елемент се може подешавати <i>појединачно</i>, преко контрола десно и лијево од елемента.<br>
        </li>
        <li>
            Може се мијењати и <i>читава</i> табела са елементима одједном.
        </li>
    </ul
    <p>
        Кад желите мијењати <b>само један</b> елемент (или додати елемент изнад/испод) онда је боље користити контроле
        на том одређеном елементу.<br>
    </p>
    <p>
        А кад желите мијењати <b>више елемената одједном</b> онда је боље отворити читаву табелу са елементима.
        Кад желите мијењати <b>редослијед</b> елемената, морате такође отворити табелу са елементима.
    </p>





<?=sct_sub()?>

    <p>
        Појединачно се елементи сценарија мијењају преко контрола у самом сценарију.<br>
    </p>
    <img src="img/scnr/scnr_mdf_elm.gif" class="img-responsive img_btm_mrg">

    <h4>Додавање елемента</h4>

    <p>
        Лијево од сваког елемента су тастери за убацивање новог елемента у ред изнад или испод.
    </p>

    <p>
        Ако притиснете контролу то јест дугме за убацивање елемента у табелу садржаја, отвориће се трака за избор елемента:
    </p>
    <img src="img/scnr/scnr_element_bar.gif" class="img-responsive img_btm_mrg">

    <p>
        Ако изаберемо ВИЈЕСТ, отвориће се страница за додавање вијести у сценарио.
        Можемо додати, то јест написати, <b>нову</b> вијест, или изабрати неку од <b>постојећих</b> вијести &ndash; из каталога.
    </p>


    <img src="img/scnr/scnr_new_elm.gif" class="img-responsive img_btm_mrg">


    <p>
        На дну табеле сценарија су још и тастери &ndash; пречице, за додавање нове вијести или новог задатка <b>на дно</b> сценарија.
    </p>

    <img src="img/desk/nwz_btmbar.gif" class="img-responsive img_btm_mrg">


    <h4>Подешавање елемента</h4>

    <p>
        Десно од сваког елемента су двије контроле – тастер за <a href="#sct_view_trash">искључивање елемента</a>,
        и тастер за подешавање елемента.
    </p>

    <p>
        Преко контроле/тастера за подешавање <img src="img/element_modify.gif"> за елемент типа <i>вијест</i>
        отвара се страница на којој можемо изабрати другу вијест..
    </p>

    <img src="img/scnr/scnr_mdf_single.gif" class="img-responsive img_btm_mrg">

    <div class="bs-callout bs-callout-primary">
        <h4>Измјене вијести</h4>
        Овдје је објашњено подешавање <b>елемента</b> у сценарију. У овом случају елемент је вијест. На страници за
        подешавање можете одредити <b><i>која</i></b> вијест ће бити повезана/асоцирана са елементом.
        Ако желимо мијењати саму вијест, нпр промијенити текст, онда преко наслова вијести требамо отворити страницу вијести, итд.
    </div>





<?=sct_sub()?>

    <p>
        Кад желимо мијењати не само један елемент него више елемената, онда контроле за појединачне измјене нису довољне,
        него требамо отворити страницу за мијењање читавог садржаја.
        У траци са контролама, сасвим десно су тастери за измјене.
        У средини је тастер за измјене <b>садржаја</b> сценарија, то јест табеле са елементима.
    </p>

    <img src="img/scnr/scnr_ctrlbar.gif" class="img-responsive img_btm_mrg">

    <p>
        Преко тастера за измјене садржаја отвара се табела са елементима, гдје се може подешавати било који елемент,
        и могу се додавати нови елементи, и може се мијењати редослијед елемената.
    </p>

    <img src="img/scnr/scnr_mdf_multi.gif" class="img-responsive img_btm_mrg">

    <h4>Колоне</h4>

    <p>
        У првој колони је <b>врста</b> елемента. Ова колона служи и за <b>премјештање</b> елемента (<i>drag&drop</i>).
    </p>

    <p>
        Друга колона (плава) и трећа колона (зелена) су за фиксно постављање <b>термина</b> и <b>трајања</b> за елемент.
        Но, ово се односи само за елементе одређеног типа, нпр маркетинг и промо блокове.<br>
        У емисијама <i>уживо</i> ове колоне обично немају сврху.
        У <i>снимљеним</i> емисијама колона за термин се користи за дефинисање кад ће снимак емисије бити
        прекинут неким другим елементом, обично маркетинг блоком.<br>
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Пречице</h4>
        У пољима за <i>термин</i> и пољима за <i>трајање</i> можете користити пречице на тастатури:
        <ul style="margin-bottom:0">
            <li>Притисните <b>минус</b> (-) да избришете читав термин или трајање</li>
            <li>Притисните <b>тачку</b> или <b>зарез</b> (.,) да пребаците курсор у сљедеће поље</li>
        </ul>
    </div>

    <div class="bs-callout bs-callout-primary">
        <p>
            Треба напоменути: за снимљене емисије се уносе <i>релативни</i> термини, то јест
            који се односе на почетак емисије, нпр не уноси се реални термин "20:35:00" него релативни "00:15:00",
            што значи да се емисија не прекида у 20:35 часова, него у 15:00 минуту емитовања.
        </p>
    </div>

    <p>
        На крају, главна колона је за бирање самог предмета из каталога, на примјер бирање одређене вијести.
    </p>

    <h4>Контроле</h4>

    <p>
        Лијево поред сваког елемента су контроле за додавање <b>новог</b> елемента изнад или испод тог реда у табели:
        <img src="img/element_insert.gif">
    </p>
    <p>
        Десно од сваког елемента су двије контроле – за <b>искључивање</b> елемента, и за <b>дуплирање</b> елемента:
        <img src="img/element_switch.gif"> <img src="img/element_duplicate.gif">
    </p>
    <p>
        Кад <i>овдје</i> искључите елемент, он ће приликом снимања форме одмах бити избрисан из сценарија,
        дакле одавде не иде у <i>корпу</i>.
    </p>

    <p>
        Дуплирање елемента ће направити <i>идентичан</i> елемент, који онда можете премјестити на друго мјесто у табели.
        На тај начин можете уштедити вријеме око дефинисања елемената нпр када се у сценарију понавља исти џингл
        на више мјеста, и слично.
    </p>






<?=sct_sub()?>

    <p>
        Још један начин који се односи ка појединачном подешавању елемената су пречице у табели садржаја
        (на страници за преглед сценарија), тачније у колонама за термин и за трајање.
    </p>

    <div class="bs-callout bs-callout-primary">
        <h4>Фиксни термини емитовања елемената</h4>
        <p>
            Термини емитовања елемената обично се <i>фиксно</i> одређују само за <b><i>снимљене</i></b> емисије.
            За емисије <b><i>уживо</i></b> се у <i>нормалном</i> раду термини емитовања елемената уопште не постављају у сценарију,
            него их Продеск <i>израчунава</i> за сваки елемент, на основу трајања претходних елемената.
        </p>
        <p>
            За емисије <i>уживо</i> се фиксни термин може употријебити можда једино у реализацији, за ручно исправљање
            нарушеног тока сценарија, дакле у <i>ванредној</i> ситуацији.<br>
            На примјер, ако се планирани сценарио емисије наруши из било каквог разлога, (рецимо, због хитног
            укључења и тсл), реализатор може реаговати тако што ће, након враћања планираном току сценарија,
            поставити фиксни термин емитовања за <i>први сљедећи</i> елемент (обично, вијест),
            да би на тај начин исправио <i>остатак</i> сценарија.
        </p>
    </div>

    <p>
        <b>Постављање фиксног термина</b>
    </p>

    <p>
        У првој колони за термин је дакле пречица за постављање <b>фиксног</b> термина емитовања елемента.
        Кад притиснете на одређени термин, отвара се оквир за измјене:
    </p>

    <img src="img/scnr/scnr_mdf_short.gif" class="img-responsive img_btm_mrg">

    <p>У поље за промјену термина укуцајте нови термин. Да потврдите промјену притисните тастер ENTER,
        а да одустанете притисните ESC.</p>
    <p><span class="glyphicon glyphicon-bell"></span> је пречица за постављање термина на тренутно вријеме,
        то јест <i>сада</i>.</p>
    <p><span class="glyphicon glyphicon-remove"></span> је пречица за <i>брисање</i> фиксног термина
        (активна је једино ако је термин претходно уопште постављен фиксно).</p>

    <p>
        <br><b>Брисање планираног трајања</b>
    </p>

    <p>
        Пречица у колони за трајање брише <i>планирано</i> трајање, да би <i>израчунато</i> трајање заузело његово мјесто.
        Може се употријебити нпр кад желимо за одређену вијест користити израчунато а не планирано трајање
        иако вијест још није стигла у фазу ГОТОВО (кад стигне у ту фазу, онда се свакако почиње користити
        израчунато трајање).<br>
        Пречица је активна једино ако вијест има и планирано и израчунато трајање, и ако је при том планирано трајање
        тренутно <i>важеће</i>.
    </p>


<?=sct_end()?>

<?=sct_start('scnr_import')?>

    <p>
        Разне информативне емисије често садрже по неколико истих вијести, на примјер "Вијести у 10" ће обично имати и
        понеку вијест из "Вијести у 8".
    </p>


    <p>
        Ако желите импортовати вијести из другог сценарија, у траци са контролама притисните тастер за импорт
        <span class="glyphicon glyphicon-import"></span>
    </p>
    <img src="img/scnr/scnr_ctrlbar.gif" class="img-responsive img_btm_mrg">
    <p>
        Отвориће се страница са три колоне:<br>
        Прва колона је <b>ЕПГ календар</b>.<br>
        За изабрани ЕПГ, у другој колони се отвара <b>листа емисија/сценарија</b>.<br>
        На крају, за изабрани сценарио се у трећој колони отвара <b>листа елемената</b>. У тој листи можете изабрати
        елементе, то јест вијести, које желите импортовати. (На дну листе елемената је дугме којим завршавате импорт.)
    </p>

    <div class="bs-callout bs-callout-warning">
        <h4>Напомена</h4>
        С обзиром да се једна вијест може повезати/асоцирати само уз један сценарио
        (то јест, два сценарија не могу користити исту вијест),
        приликом импорта вијести из једног сценарија у други аутоматски се прави <b>копија</b> сваке
        вијести, и у сценарио се уствари повезују те копије.<br>
        При том, копијама се у наслову додаје "+", ради лакшег разликовања оригинала и копије у каталогу вијести.
    </div>

<?=sct_end()?>



<?=sct_start('tmpl')?>

    <p>
        Свака емисија има барем неколико елемената који се <b>понављају</b> сваки пут. На примјер, шпица је увијек иста.
        Обично се и сегменти не мијењају, нпр Дневник увијек има увод са форшпаном, вијести из земље, из свијета,
        из региона, итд.
    </p>
    <p>
        Елементе који се понављају зато треба снимити у шаблон, тако да се не морају увијек испочетка додавати у сваки
        сценарио, него се аутоматски копирају/импортују из шаблона сваки пут кад се отвори нови сценарио за ту емисију.
    </p>
    <p>
        За сваку емисију може се дефинисати <i>више</i> шаблона, зато што се понекад деси да емисија има више него један
        типичан сценарио, нпр један за радне дане а један за викенд. Но, само један шаблон може да се означи као
        <b>дефолт</b>, и тај шаблон ће се примјењивати аутоматски за сваки нови сценарио те емисије.<br>
        Знак за дефолт шаблон је: <span class="glyphicon glyphicon-thumbs-up"></span>
    </p>
    <p>
        Ако је потребно, може се на страници емисије <i>искључити</i> аутоматски импорт дефолт шаблона. У том случају,
        а такође у случају да за одређену емисију ниједан шаблон није означен као дефолт, у празном сценарију
        се приказује комбиновани тастер за импорт шаблона:
    </p>
        <img src="img/scnr/scnr_btn_tmpl.gif" class="img-responsive img_btm_mrg">
    <p>
        Лијеви тастер је за импорт <b>дефолт</b> шаблона,
        а десни (<i>drop-down</i>) отвара поље у којем је линк за бирање шаблона <b>из листе</b>.
    </p>

<?=sct_sub()?>

    <ol style="padding-left:20px">
        <li>Кад отворите страницу ШАБЛОНИ, на врху је трака у којој бирате врсту шаблона &ndash; ЕПГ или Сценарио.<br>
            Изаберите <b>Сценарио</b> и приказаће се листа шаблона за емисије/сценарије.</li>
        <li><p>У траци на врху изаберите емисију за коју желите направити нови шаблон, и онда ће тастер за додавање
            новог шаблона постати активан.</p>
            <img src="img/scnr/scnr_tmpl_headbar.gif" class="img-responsive img_btm_mrg">
        </li>
        <li>Кад притиснете тастер, отвориће се позната табела са елементима, као кад
            мијењате било који сценарио. Једина разлика је што у заглављу има додатно поље за наслов шаблона.</li>
    </ol>

    <p>
        Шаблон сценарија може садржавати све елементе као и обичан сценарио.
    </p>

<?=sct_end()?>



<?php
require '_foot.php';